// BSLLS:MissingVariablesDescription-off Поля &Опция/&Аргумент/&НаборОпций - описания заданы в самой аннотации.
// BSLLS:UnusedLocalVariable-off Поля &Опция/&Лог инициализируются autumn-фреймворком через рефлексию.
&Лог("vrunner")
Перем Лог;

&Пластилин
Перем СервисЗаполненияПараметров;

&НаборОпций("НаборОпцийНастроек")
Перем ОпцииНастроек; // BSLLS:UnusedLocalVariable-off

&ПодкомандаПриложения(Имя = "edt", Родитель = "КомандаValidate", Описание = "Проверка проекта в EDT")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ВыполнениеКоманды
Процедура ВыполнитьДействие() Экспорт

	СервисЗаполненияПараметров.Заполнить(ЭтотОбъект);

	ВызватьИсключение "Команда validate edt ещё не реализована";
КонецПроцедуры
