#Использовать asserts
#Использовать tempfiles
#Использовать "utils"
#Использовать "../.."

#Область ОписаниеПеременных

Перем НакопленныеВременныеФайлы; // фиксация накопленных времнных файлов для сброса

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

&Тест
Процедура ТестДолжен_СобратьРасширениеИзИсходниковВТекущуюБазуIbcmd() Экспорт

	// Дано
	ИмяРасширения = "testNew";

	Исполнитель = Новый Тест_ИсполнительКоманд("compileext");
	Исполнитель.УстановитьКонтекстПустаяИБ();

	КаталогSrc = Исполнитель.ПутьТестовыхДанных("cfe");
	Исполнитель.ДобавитьПараметр(КаталогSrc);
	Исполнитель.ДобавитьПараметр(ИмяРасширения);
	Исполнитель.ДобавитьФлаг("--ibcmd");

	// Когда
	Исполнитель.ВыполнитьКоманду();

	// Тогда
	Исполнитель.ОжидаемЧтоВыводСодержит("Используется ibcmd");
	Исполнитель.ОжидаемЧтоВыводСодержит("Сборка расширения testNew из исходников завершена.");
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗапускомТеста() Экспорт
	
	НакопленныеВременныеФайлы = ВременныеФайлы.Файлы();
	
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
	
	ВременныеФайлы.УдалитьНакопленныеВременныеФайлы(НакопленныеВременныеФайлы);
	
КонецПроцедуры

#КонецОбласти
