#Использовать asserts
#Использовать tempfiles
#Использовать "utils"
#Использовать "..\.."

#Область ОписаниеПеременных

Перем НакопленныеВременныеФайлы; // фиксация накопленных времнных файлов для сброса

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

&Тест
Процедура ТестДолжен_СобратьРасширениеИзИсходниковВТекущуюБазуIbcmd() Экспорт

	// Дано
	Исполнитель = Новый Тест_ИсполнительКоманд("compileexttocfe");
	Исполнитель.УстановитьКонтекстПустаяИБ();

	КаталогSrc = Исполнитель.ПутьТестовыхДанных("cfe");
	Исполнитель.ДобавитьФлаг("--current");
	Исполнитель.ДобавитьПараметр("--src", КаталогSrc);
	Исполнитель.ДобавитьПараметр("--out", "./Расширение1.cfe");
    Исполнитель.ДобавитьФлаг("--ibcmd");

	// Когда
	Исполнитель.ВыполнитьКоманду();

	// Тогда
	Исполнитель.ОжидаемЧтоВыводСодержит("Используется ibcmd");
	Исполнитель.ОжидаемЧтоВыводСодержит("Сборка расширения из исходников в текущую ИБ завершена.");
	Исполнитель.ОжидаемЧтоФайлСуществует("Расширение1.cfe");
		
КонецПроцедуры

&Тест
Процедура ТестДолжен_СобратьКонфигурациюИзИсходниковIbcmd() Экспорт

	// Дано
	Исполнитель = Новый Тест_ИсполнительКоманд("compileexttocfe");
	КаталогSrc = Исполнитель.ПутьТестовыхДанных("cfe");
	Исполнитель.ДобавитьПараметр("--src", КаталогSrc);
	Исполнитель.ДобавитьПараметр("--out", "Расширение1.cfe");
	Исполнитель.ДобавитьФлаг("--ibcmd");

	// Когда
	Исполнитель.ВыполнитьКоманду();

	// Тогда
	Исполнитель.ОжидаемЧтоВыводСодержит("Используется ibcmd");
	Исполнитель.ОжидаемЧтоВыводСодержит("Сборка расширения из исходников в файл cfe завершена.");
	Исполнитель.ОжидаемЧтоФайлСуществует("Расширение1.cfe");

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗапускомТеста() Экспорт
	
	НакопленныеВременныеФайлы = ВременныеФайлы.Файлы();
	
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
	
	ВременныеФайлы.УдалитьНакопленныеВременныеФайлы(НакопленныеВременныеФайлы);
	
КонецПроцедуры

#КонецОбласти