#Использовать asserts
#Использовать tempfiles
#Использовать "utils"
#Использовать "..\.."

#Область ОписаниеПеременных

Перем НакопленныеВременныеФайлы; // фиксация накопленных времнных файлов для сброса

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

&Тест
Процедура ТестДолжен_РазобратьТекущуюКонфигурациюНаИсходникиIbcmd() Экспорт

	// Дано
	Исполнитель = Новый Тест_ИсполнительКоманд("decompile");
	КаталогSrc = Исполнитель.ПутьТестовыхДанных("cf");
	Исполнитель.УстановитьКонтекстИБИзФайловКонфигурации(КаталогSrc);
	Исполнитель.ДобавитьПараметр("--out", "src");
	Исполнитель.ДобавитьФлаг("--current");
	Исполнитель.ДобавитьФлаг("--ibcmd");

	// Когда
	Исполнитель.ВыполнитьКоманду();

	// Тогда
	Исполнитель.ОжидаемЧтоВыводСодержит("Используется ibcmd");
	Исполнитель.ОжидаемЧтоВыводСодержит("Разборка конфигурации текущей ИБ на исходники завершена.");
	Исполнитель.ОжидаемЧтоФайлСуществует("src/Configuration.xml");
	Исполнитель.ОжидаемЧтоФайлСуществует("src/Catalogs/Справочник1.xml");

КонецПроцедуры

&Тест
Процедура ТестДолжен_РазобратьФайлКонфигурацииНаИсходникиIbcmd() Экспорт

	// Дано
	Исполнитель = Новый Тест_ИсполнительКоманд("decompile");
	ФайлCf = Исполнитель.ПутьТестовыхДанных("1Cv8.cf");
	Исполнитель.ДобавитьПараметр("--in", ФайлCf);
	Исполнитель.ДобавитьПараметр("--out", "src");
	Исполнитель.ДобавитьФлаг("--ibcmd");

	// Когда
	Исполнитель.ВыполнитьКоманду();

	// Тогда
	Исполнитель.ОжидаемЧтоВыводСодержит("Используется ibcmd");
	Исполнитель.ОжидаемЧтоВыводСодержит("Разборка cf-файла на исходники завершена.");
	Исполнитель.ОжидаемЧтоФайлСуществует("src/Configuration.xml");
	Исполнитель.ОжидаемЧтоФайлСуществует("src/Catalogs/Справочник1.xml");

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗапускомТеста() Экспорт
	
	НакопленныеВременныеФайлы = ВременныеФайлы.Файлы();
	
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
	
	ВременныеФайлы.УдалитьНакопленныеВременныеФайлы(НакопленныеВременныеФайлы);
	
КонецПроцедуры

#КонецОбласти
