#Использовать tempfiles
#Использовать "utils"
#Использовать "../.."

#Область ОписаниеПеременных

Перем НакопленныеВременныеФайлы; // фиксация накопленных времнных файлов для сброса

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

&Тест
Процедура ТестДолжен_ДеактивироватьРасширение() Экспорт

	// Дано
	Исполнитель = Новый Тест_ИсполнительКоманд("extparams");
	Исполнитель.ДобавитьПараметр("test");
	Исполнитель.ДобавитьПараметр("--active", "false");

	Исполнитель.УстановитьКонтекстПустаяИБ();
	Исполнитель.СоздатьПустоеРасширение("test", "Ext1_");

	// Когда
	Исполнитель.ВыполнитьКоманду();

	// Тогда
	Исполнитель.ОжидаемЧтоВыводСодержит("Активность расширения: Нет");
	Исполнитель.ОжидаемЧтоВыводСодержитРегулярноеВыражение("active\s+:\s+no");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ВыключитьИспользованиеБезопасногоРежима() Экспорт

	// Дано
	Исполнитель = Новый Тест_ИсполнительКоманд("extparams");
	Исполнитель.ДобавитьПараметр("test");
	Исполнитель.ДобавитьПараметр("--safe-mode", "false");

	Исполнитель.УстановитьКонтекстПустаяИБ();
	Исполнитель.СоздатьПустоеРасширение("test", "Ext1_");

	// Когда
	Исполнитель.ВыполнитьКоманду();

	// Тогда
	Исполнитель.ОжидаемЧтоВыводСодержит("Безопасный режим расширения: Нет");
	Исполнитель.ОжидаемЧтоВыводСодержитРегулярноеВыражение("safe-mode\s+:\s+no");

КонецПроцедуры

&Тест
Процедура ТестДолжен_УстановитьИмяПрофиляБезопасности() Экспорт

	// Дано
	Исполнитель = Новый Тест_ИсполнительКоманд("extparams");
	Исполнитель.ДобавитьПараметр("test");
	Исполнитель.ДобавитьПараметр("--security-profile-name", "Strong");

	Исполнитель.УстановитьКонтекстПустаяИБ();
	Исполнитель.СоздатьПустоеРасширение("test", "Ext1_");

	// Когда
	Исполнитель.ВыполнитьКоманду();

	// Тогда
	Исполнитель.ОжидаемЧтоВыводСодержит("Имя профиля безопасности расширения: Strong");
	Исполнитель.ОжидаемЧтоВыводСодержитРегулярноеВыражение("safe-mode\s+:\s+yes");
	Исполнитель.ОжидаемЧтоВыводСодержитРегулярноеВыражение("security-profile-name\s+:\s+""Strong""");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ВключитьЗащитуОтОпасныхДействий() Экспорт

	// Дано
	Исполнитель = Новый Тест_ИсполнительКоманд("extparams");
	Исполнитель.ДобавитьПараметр("test");
	Исполнитель.ДобавитьПараметр("--unsafe-action-protection", "true");

	Исполнитель.УстановитьКонтекстПустаяИБ();
	Исполнитель.СоздатьПустоеРасширение("test", "Ext1_");

	// Когда
	Исполнитель.ВыполнитьКоманду();

	// Тогда
	Исполнитель.ОжидаемЧтоВыводСодержит("Режим защиты от опасных действий расширения: Да");
	Исполнитель.ОжидаемЧтоВыводСодержитРегулярноеВыражение("unsafe-action-protection\s+:\s+yes");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ВключитьИспользованиеВРИБ() Экспорт

	// Дано
	Исполнитель = Новый Тест_ИсполнительКоманд("extparams");
	Исполнитель.ДобавитьПараметр("test");
	Исполнитель.ДобавитьПараметр("--used-in-distributed-infobase", "yes");

	Исполнитель.УстановитьКонтекстПустаяИБ();
	Исполнитель.СоздатьПустоеРасширение("test", "Ext1_");

	// Когда
	Исполнитель.ВыполнитьКоманду();

	// Тогда
	Исполнитель.ОжидаемЧтоВыводСодержит("Режим использования расширения в распределенной информационной базе: Да");
	Исполнитель.ОжидаемЧтоВыводСодержитРегулярноеВыражение("used-in-distributed-infobase\s+:\s+yes");

КонецПроцедуры

&Тест
Процедура ТестДолжен_НеВыводитьИнформациюОРасширении() Экспорт
	
	Исполнитель = Новый Тест_ИсполнительКоманд("extparams");
	Исполнитель.ДобавитьПараметр("test");
	Исполнитель.ДобавитьПараметр("--no-info");

	Исполнитель.УстановитьКонтекстПустаяИБ();
	Исполнитель.СоздатьПустоеРасширение("test", "Ext1_");

	// Когда
	Исполнитель.ВыполнитьКоманду();

	// Тогда
	Исполнитель.ОжидаемЧтоВыводСодержит("Свойства расширения не изменяются");
	Исполнитель.ОжидаемЧтоВыводСодержит("Информация о свойствах расширения не выводится");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ВывестиИнформациюОРасширении() Экспорт
	
	Исполнитель = Новый Тест_ИсполнительКоманд("extparams");
	Исполнитель.ДобавитьПараметр("test");

	Исполнитель.УстановитьКонтекстПустаяИБ();
	Исполнитель.СоздатьПустоеРасширение("test", "Ext1_");

	// Когда
	Исполнитель.ВыполнитьКоманду();

	// Тогда
	Исполнитель.ОжидаемЧтоВыводСодержит("Свойства расширения не изменяются");
	Исполнитель.ОжидаемЧтоВыводСодержит("Информация о расширении конфигурации:");

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗапускомТеста() Экспорт
	
	НакопленныеВременныеФайлы = ВременныеФайлы.Файлы();
	
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
	
	ВременныеФайлы.УдалитьНакопленныеВременныеФайлы(НакопленныеВременныеФайлы);
	
КонецПроцедуры

#КонецОбласти
