#Использовать asserts
#Использовать tempfiles
#Использовать "utils"
#Использовать "..\.."

#Область ОписаниеПеременных

Перем НакопленныеВременныеФайлы; // фиксация накопленных времнных файлов для сброса

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

&Тест
Процедура ТестДолжен_ВыгрузитьИнформационноюБазуВФайлIbcmd() Экспорт

	// Дано
	Исполнитель = Новый Тест_ИсполнительКоманд("restore");
	ФайлDt = Исполнитель.ПутьТестовыхДанных("1cv8.dt");
	Исполнитель.ДобавитьПараметр(ФайлDt);
	Исполнитель.УстановитьКонтекстПустаяИБ();
	Исполнитель.ДобавитьФлаг("--ibcmd");
	
	// Когда
	Исполнитель.ВыполнитьКоманду();

	// Тогда
	Исполнитель.ОжидаемЧтоВыводСодержит("Используется ibcmd");
	Исполнитель.ОжидаемЧтоВыводСодержит("Загрузка информационной базы из dt завершена.");
		
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗапускомТеста() Экспорт
	
	НакопленныеВременныеФайлы = ВременныеФайлы.Файлы();
	
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
	
	ВременныеФайлы.УдалитьНакопленныеВременныеФайлы(НакопленныеВременныеФайлы);
	
КонецПроцедуры

#КонецОбласти
