#Использовать asserts
#Использовать tempfiles
#Использовать "utils"
#Использовать "..\.."

#Область ОписаниеПеременных

Перем НакопленныеВременныеФайлы; // фиксация накопленных времнных файлов для сброса

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

&Тест
Процедура ТестДолжен_ВыполнитьФичуПаузаIbcmd() Экспорт

	// Дано
	Исполнитель = Новый Тест_ИсполнительКоманд("vanessa");
	Исполнитель.УстановитьКонтекстПустаяИБ();

	ФайлНастроек = Исполнитель.ПутьТестовыхДанных("feature/vb-conf.json");
	ПутьКФичам = Исполнитель.ПутьТестовыхДанных("feature/Пауза");

	Исполнитель.ДобавитьПараметр("--vanessasettings", ФайлНастроек);
	Исполнитель.ДобавитьПараметр("--path", ПутьКФичам);
	Исполнитель.ДобавитьФлаг("--ibsrv");
	
	// Когда
	Исполнитель.ВыполнитьКоманду();

	// Тогда
	Исполнитель.ОжидаемЧтоВыводСодержит("Используется ibsrv");
	Исполнитель.ОжидаемЧтоВыводСодержит("Все фичи/сценарии выполнены!");
		
КонецПроцедуры

&Тест
Процедура ТестДолжен_ВыполнитьНереализованнуюФичуIbcmd() Экспорт

	// Дано
	Исполнитель = Новый Тест_ИсполнительКоманд("vanessa");
	Исполнитель.УстановитьКонтекстПустаяИБ();

	ФайлНастроек = Исполнитель.ПутьТестовыхДанных("feature/vb-conf.json");
	ПутьКФичам = Исполнитель.ПутьТестовыхДанных("feature/Без реализации шага");

	Исполнитель.ДобавитьПараметр("--vanessasettings", ФайлНастроек);
	Исполнитель.ДобавитьПараметр("--path", ПутьКФичам);
	Исполнитель.ДобавитьФлаг("--ibsrv");
	
	// Когда
	Исполнитель.ВыполнитьКоманду();

	// Тогда
	Исполнитель.ОжидаемЧтоВыводСодержит("Используется ibsrv");
	Исполнитель.ОжидаемЧтоВыводСодержит("Пустой адрес снипета у шага: Когда я выполняю несуществующий шаг");
			
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗапускомТеста() Экспорт
	
	НакопленныеВременныеФайлы = ВременныеФайлы.Файлы();
	
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
	
	ВременныеФайлы.УдалитьНакопленныеВременныеФайлы(НакопленныеВременныеФайлы);
	
КонецПроцедуры

#КонецОбласти
