#Использовать asserts
#Использовать tempfiles
#Использовать "utils"
#Использовать "../.."

#Область ОписаниеПеременных

Перем НакопленныеВременныеФайлы; // фиксация накопленных времнных файлов для сброса

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

&Тест
Процедура ТестДолжен_ВыполнитьФичуПаузаIbsrv() Экспорт

	// Дано
	Исполнитель = Новый Тест_ИсполнительКоманд("vanessa");
	УстановитьКонтекстИБ(Исполнитель);

	ФайлНастроек = Исполнитель.ПутьТестовыхДанных("feature/vb-conf.json");
	ПутьКФичам = Исполнитель.ПутьТестовыхДанных("feature/Пауза");

	Исполнитель.ДобавитьПараметр("--vanessasettings", ФайлНастроек);
	Исполнитель.ДобавитьПараметр("--path", ПутьКФичам);
	Исполнитель.ДобавитьФлаг("--ibsrv");
	Исполнитель.УстановитьУровеньЛога(УровниЛога.Отладка);
	
	// Когда
	Исполнитель.ВыполнитьКоманду();

	// Тогда
	Исполнитель.ОжидаемЧтоВыводСодержит("Используется ibsrv");
	Исполнитель.ОжидаемЧтоВыводСодержит("Все фичи/сценарии выполнены!");
		
КонецПроцедуры

&Тест
Процедура ТестДолжен_ВыполнитьНереализованнуюФичуIbsrv() Экспорт

	// Дано
	Исполнитель = Новый Тест_ИсполнительКоманд("vanessa");
	УстановитьКонтекстИБ(Исполнитель);

	ФайлНастроек = Исполнитель.ПутьТестовыхДанных("feature/vb-conf.json");
	ПутьКФичам = Исполнитель.ПутьТестовыхДанных("feature/Без реализации шага");

	Исполнитель.ДобавитьПараметр("--vanessasettings", ФайлНастроек);
	Исполнитель.ДобавитьПараметр("--path", ПутьКФичам);
	Исполнитель.ДобавитьФлаг("--ibsrv");
	
	// Когда
	Исполнитель.ВыполнитьКоманду();

	// Тогда
	Исполнитель.ОжидаемЧтоВыводСодержит("Используется ibsrv");
	Исполнитель.ОжидаемЧтоВыводСодержит("Пустой адрес снипета у шага: Когда я выполняю несуществующий шаг");
			
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗапускомТеста() Экспорт
	
	НакопленныеВременныеФайлы = ВременныеФайлы.Файлы();
	
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
	
	ВременныеФайлы.УдалитьНакопленныеВременныеФайлы(НакопленныеВременныеФайлы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура УстановитьКонтекстИБ(Исполнитель)
	КаталогПроекта = Исполнитель.КаталогКоманды();
	КаталогИсходников = ОбъединитьПути(КаталогПроекта, "src", "cf");
	КаталогSrc = Исполнитель.ПутьТестовыхДанных("cf");

	ФС.КопироватьСодержимоеКаталога(КаталогSrc, КаталогИсходников);

	Исполнитель.УстановитьКонтекстИБИзФайловКонфигурации(КаталогИсходников);
КонецПроцедуры
#КонецОбласти
