// Общие опции администрирования кластера серверов 1С.
// Подключается к команде через &НаборОпций("НаборОпцийАдминистрирования").

&Опция(Имя = "cluster-admin", Описание = "Имя администратора кластера серверов")
&ТСтрока
&ВОкружении("VRUNNER_CLUSTERADMIN_USER")
Перем АдминистраторКластера Экспорт;

&Опция(Имя = "cluster-pwd", Описание = "Пароль администратора кластера серверов")
&ТСтрока
&ВОкружении("VRUNNER_CLUSTERADMIN_PWD")
Перем ПарольКластера Экспорт;

&НаборОпций
Процедура ПриСозданииОбъекта()
КонецПроцедуры
