// Общие опции запуска 1С.
// Подключается к команде через &НаборОпций("НаборОпцийЗапуска").

&Опция(Имя = "nocacheuse", Описание = "Не использовать кеш платформы")
&Флаговый
&ВОкружении("VRUNNER_NOCACHEUSE")
Перем НеИспользоватьКеш Экспорт;

&Опция(Имя = "ordinaryapp", Описание = "Режим запуска клиента")
&ТПеречисление
&Перечисление(Имя = "1", Значение = "1", Описание = "Толстый клиент")
&Перечисление(Имя = "0", Значение = "0", Описание = "Тонкий клиент")
&Перечисление(Имя = "-1", Значение = "-1", Описание = "Авто")
&ВОкружении("VRUNNER_ORDINARYAPP")
Перем РежимЗапуска Экспорт;

&Опция(Имя = "additional", Описание = "Дополнительные параметры запуска платформы")
&ТСтрока
&ВОкружении("VRUNNER_ADDITIONAL")
Перем ДополнительныеПараметры Экспорт;

&Опция(Имя = "ibsrv", Описание = "Запускать команду через автономный сервер ibsrv (только для файловых ИБ)")
&Флаговый
&ВОкружении("VRUNNER_IBSRV")
Перем ИспользоватьIbsrv Экспорт;

&Опция(Имя = "ibsrv-direct", Описание = "Использовать прямое соединение с ibsrv (по умолчанию - через WS)")
&Флаговый
&ВОкружении("VRUNNER_IBSRV_DIRECT")
Перем ИспользоватьПрямоеСоединениеIbsrv Экспорт;

&Опция(Имя = "ibsrv-debug", Описание = "Включить порт отладки на запущенном ibsrv")
&Флаговый
&ВОкружении("VRUNNER_IBSRV_DEBUG")
Перем ИспользоватьОтладкуIbsrv Экспорт;

&НаборОпций
Процедура ПриСозданииОбъекта()
КонецПроцедуры
