// Общие опции подключения к информационной базе.
// Подключается к команде через &НаборОпций("НаборОпцийПодключения").

&Опция(Имя = "ibconnection", Описание = "Строка подключения к информационной базе (/F или /S)")
&ТСтрока
&ВОкружении("VRUNNER_IBCONNECTION")
Перем СтрокаПодключения Экспорт;

&Опция(Имя = "db-user", Описание = "Имя пользователя информационной базы")
&ТСтрока
&ВОкружении("VRUNNER_DBUSER")
Перем Пользователь Экспорт;

&Опция(Имя = "db-pwd", Описание = "Пароль пользователя информационной базы")
&ТСтрока
&ВОкружении("VRUNNER_DBPWD")
Перем Пароль Экспорт;

&Опция(Имя = "ibcmd", Описание = "Использовать утилиту ibcmd вместо конфигуратора")
&Флаговый
Перем ИспользоватьIbcmd Экспорт;

&НаборОпций
Процедура ПриСозданииОбъекта()
КонецПроцедуры
