// BSLLS-off
// Сбор покрытия по юнит-тестам.
#Использовать 1commands
#Использовать fs
#Использовать coverage

ИмяКаталогаОтчетов = ОбъединитьПути(".", "build", "reports");
ИмяКаталогаФайловПокрытия = ОбъединитьПути(".", "build", "coverage");
ПутьКОтчетуJUnit = ОбъединитьПути(ИмяКаталогаОтчетов, "junit-unit.xml");

ФС.ОбеспечитьПустойКаталог(ИмяКаталогаФайловПокрытия);
ФС.ОбеспечитьКаталог(ИмяКаталогаОтчетов);

ПутьGenericCoverage = ОбъединитьПути(ИмяКаталогаФайловПокрытия, "genericCoverage.xml");
ПутьCobertura = ОбъединитьПути(ИмяКаталогаФайловПокрытия, "cobertura.xml");

КаталогиТестов = Новый Массив;
КаталогиТестов.Добавить("tests/unit/Сервисы");
КаталогиТестов.Добавить("tests/unit/Движки");

Команда = Новый Команда;
Команда.УстановитьКоманду("oneunit");
Команда.ДобавитьПараметр("execute");
Для Каждого Каталог Из КаталогиТестов Цикл
	Команда.ДобавитьПараметр("-d " + Каталог);
КонецЦикла;
Команда.ДобавитьПараметр("-r");
Команда.ДобавитьПараметр("--junit " + ПутьКОтчетуJUnit);
Команда.ДобавитьПараметр("--genericCoverage " + ПутьGenericCoverage);
Команда.ДобавитьПараметр("--cobertura " + ПутьCobertura);
Команда.ПоказыватьВыводНемедленно(Истина);

КодВозврата = Команда.Исполнить();

Если КодВозврата <> 0 Тогда
	ВызватьИсключение "Юнит-тесты с покрытием завершились неудачно!";
КонецЕсли;
