#Использовать 1bdd

Перем СохраненныйТекущийКаталог;

Процедура СохранитьТекущийКаталог()
	// Лог.Отладка("Сохранил текущий каталог %1", СохраненныйТекущийКаталог);
	СохраненныйТекущийКаталог = ТекущийКаталог();
КонецПроцедуры

Процедура ВосстановитьТекущийКаталог()
	// Лог.Отладка("Восстановил текущий каталог %1", СохраненныйТекущийКаталог);
	УстановитьТекущийКаталог(СохраненныйТекущийКаталог);
КонецПроцедуры

КаталогФич = ОбъединитьПути(".", "features");
ПутьОтчетаJUnit = ОбъединитьПути(".", "bdd-exec.xml");

Файл_КаталогФич = Новый Файл(КаталогФич);

СохранитьТекущийКаталог();

ИсполнительБДД = Новый ИсполнительБДД;
РезультатВыполнения = ИсполнительБДД.ВыполнитьФичу(Файл_КаталогФич, Файл_КаталогФич);
ИтоговыйСтатусВыполнения = ИсполнительБДД.ПолучитьИтоговыйСтатусВыполнения(РезультатВыполнения);

Сообщить(ИтоговыйСтатусВыполнения);

ВосстановитьТекущийКаталог();

// Если Не ПустаяСтрока(ПутьОтчетаJUnit) Тогда
    ГенераторОтчетаJUnit = Новый ГенераторОтчетаJUnit;
    ГенераторОтчетаJUnit.Сформировать(РезультатВыполнения, ИтоговыйСтатусВыполнения, ПутьОтчетаJUnit);
// КонецЕсли;

Если ИтоговыйСтатусВыполнения = ИсполнительБДД.ВозможныеСтатусыВыполнения().Сломался Тогда
    ВызватьИсключение 1;
КонецЕсли;
