#Использовать 1bdd
#Использовать fs

Перем СохраненныйТекущийКаталог;

Процедура СохранитьТекущийКаталог()
	СохраненныйТекущийКаталог = ТекущийКаталог();
КонецПроцедуры

Процедура ВосстановитьТекущийКаталог()
	УстановитьТекущийКаталог(СохраненныйТекущийКаталог);
КонецПроцедуры

КаталогФайловПокрытия = ОбъединитьПути(ТекущийКаталог(), ".", "coverage");

ИспользуетсяПокрытиеКода = Ложь;
Для каждого Элемент из АргументыКоманднойСтроки Цикл
	Если Элемент = "coverage" Тогда
		ИспользуетсяПокрытиеКода = Истина;
	КонецЕсли;
КонецЦикла;


ИсполнительБДД = Новый ИсполнительБДД;
Если ИспользуетсяПокрытиеКода Тогда 
	ИсполнительБДД.СохранитьВКонтекст("ПризнакСтатистикиСкриптовOnescript", Новый Файл(КаталогФайловПокрытия));
КонецЕсли;

КаталогФич = ОбъединитьПути(".", "features");
ПутьОтчетаJUnit = ОбъединитьПути(".", "bdd-exec.xml");

Файл_КаталогФич = Новый Файл(КаталогФич);

СохранитьТекущийКаталог();

РезультатВыполнения = ИсполнительБДД.ВыполнитьФичу(Файл_КаталогФич, Файл_КаталогФич);
ИтоговыйСтатусВыполнения = ИсполнительБДД.ПолучитьИтоговыйСтатусВыполнения(РезультатВыполнения);

Сообщить(ИтоговыйСтатусВыполнения);

ВосстановитьТекущийКаталог();

Если Не ПустаяСтрока(ПутьОтчетаJUnit) Тогда
    ГенераторОтчетаJUnit = Новый ГенераторОтчетаJUnit;
    ГенераторОтчетаJUnit.Сформировать(РезультатВыполнения, ИтоговыйСтатусВыполнения, ПутьОтчетаJUnit);
КонецЕсли;

Если ИтоговыйСтатусВыполнения = ИсполнительБДД.ВозможныеСтатусыВыполнения().Сломался Тогда
    ВызватьИсключение 1;
КонецЕсли;
