#Использовать 1bdd
#Использовать fs
#Использовать 1commands

Перем СохраненныйТекущийКаталог;

Процедура СохранитьТекущийКаталог()
	СохраненныйТекущийКаталог = ТекущийКаталог();
КонецПроцедуры

Процедура ВосстановитьТекущийКаталог()
	УстановитьТекущийКаталог(СохраненныйТекущийКаталог);
КонецПроцедуры

ИспользуетсяПокрытиеКода = Ложь;
Для каждого Элемент из АргументыКоманднойСтроки Цикл
	Если Элемент = "coverage" Тогда
		ИспользуетсяПокрытиеКода = Истина;
	КонецЕсли;
КонецЦикла;

КаталогОбработок = ОбъединитьПути(ТекущийКаталог(), ".", "epf");
МассивФайлов = НайтиФайлы(КаталогОбработок, "*.epf");
Если МассивФайлов.Количество() = 0 Тогда 
	Команда = Новый Команда;
	Команда.УстановитьКоманду("oscript");
	Команда.ПоказыватьВыводНемедленно(Истина);
	// Команда.ДобавитьПараметр("-encoding=utf-8");
	Команда.ДобавитьПараметр("tasks/build.os");

	КодВозврата = Команда.Исполнить();
	Сообщить(Команда.ПолучитьВывод());
КонецЕсли;


КаталогФайловПокрытия = ОбъединитьПути(ТекущийКаталог(), ".", "coverage");

ИсполнительБДД = Новый ИсполнительБДД;
Если ИспользуетсяПокрытиеКода Тогда 
	ИсполнительБДД.СохранитьВКонтекст("ПризнакСтатистикиСкриптовOnescript", Новый Файл(КаталогФайловПокрытия));
КонецЕсли;

// ПутьФичи = ОбъединитьПути(".", "features", "ПростыеКоманды.feature");
// ФайлФичи = Новый Файл(ПутьФичи);
КаталогФич = ОбъединитьПути(".", "features");
ПутьОтчетаJUnit = ОбъединитьПути(".", "bdd-exec.xml");

Файл_КаталогФич = Новый Файл(КаталогФич);

СохранитьТекущийКаталог();

// ИсполнительБДД = Новый ИсполнительБДД;
// РезультатВыполнения = ИсполнительБДД.ВыполнитьФичу(ФайлФичи, Файл_КаталогФич);
РезультатВыполнения = ИсполнительБДД.ВыполнитьФичу(Файл_КаталогФич, Файл_КаталогФич);
ИтоговыйСтатусВыполнения = ИсполнительБДД.ПолучитьИтоговыйСтатусВыполнения(РезультатВыполнения);

Сообщить(ИтоговыйСтатусВыполнения);

ВосстановитьТекущийКаталог();

Если Не ПустаяСтрока(ПутьОтчетаJUnit) Тогда
    ГенераторОтчетаJUnit = Новый ГенераторОтчетаJUnit;
    ГенераторОтчетаJUnit.Сформировать(РезультатВыполнения, ИтоговыйСтатусВыполнения, ПутьОтчетаJUnit);
КонецЕсли;

Если ИтоговыйСтатусВыполнения = ИсполнительБДД.ВозможныеСтатусыВыполнения().Сломался Тогда
    ВызватьИсключение 1;
КонецЕсли;
