#Использовать 1bdd
#Использовать fs

Перем СохраненныйТекущийКаталог;

Процедура СохранитьТекущийКаталог()
	СохраненныйТекущийКаталог = ТекущийКаталог();
КонецПроцедуры

Процедура ВосстановитьТекущийКаталог()
	УстановитьТекущийКаталог(СохраненныйТекущийКаталог);
КонецПроцедуры

КаталогФайловПокрытия = ОбъединитьПути(ТекущийКаталог(), ".", "coverage");

ИсполнительБДД = Новый ИсполнительБДД;
ИсполнительБДД.СохранитьВКонтекст("ПризнакСтатистикиСкриптовOnescript", Новый Файл(КаталогФайловПокрытия));

// ПутьФичи = ОбъединитьПути(".", "features", "ПростыеКоманды.feature");
// ФайлФичи = Новый Файл(ПутьФичи);
КаталогФич = ОбъединитьПути(".", "features");
ПутьОтчетаJUnit = ОбъединитьПути(".", "bdd-exec.xml");

Файл_КаталогФич = Новый Файл(КаталогФич);

СохранитьТекущийКаталог();

// ИсполнительБДД = Новый ИсполнительБДД;
// РезультатВыполнения = ИсполнительБДД.ВыполнитьФичу(ФайлФичи, Файл_КаталогФич);
РезультатВыполнения = ИсполнительБДД.ВыполнитьФичу(Файл_КаталогФич, Файл_КаталогФич);
ИтоговыйСтатусВыполнения = ИсполнительБДД.ПолучитьИтоговыйСтатусВыполнения(РезультатВыполнения);

Сообщить(ИтоговыйСтатусВыполнения);

ВосстановитьТекущийКаталог();

Если Не ПустаяСтрока(ПутьОтчетаJUnit) Тогда
    ГенераторОтчетаJUnit = Новый ГенераторОтчетаJUnit;
    ГенераторОтчетаJUnit.Сформировать(РезультатВыполнения, ИтоговыйСтатусВыполнения, ПутьОтчетаJUnit);
КонецЕсли;

Если ИтоговыйСтатусВыполнения = ИсполнительБДД.ВозможныеСтатусыВыполнения().Сломался Тогда
    ВызватьИсключение 1;
КонецЕсли;
