// Прогон фич
// При передаче параметра coverage будет включен подсчет покрытия кода,
// в т.ч. для кода скриптов, запускаемых из фич

#Использовать 1bdd
#Использовать fs

Перем СохраненныйТекущийКаталог;

Процедура СохранитьТекущийКаталог()
	СохраненныйТекущийКаталог = ТекущийКаталог();
КонецПроцедуры

Процедура ВосстановитьТекущийКаталог()
	УстановитьТекущийКаталог(СохраненныйТекущийКаталог);
КонецПроцедуры

// для Github-actions нужно очищать переменную среды RUNNER_WORKSPACE т.к. она там используется.
УстановитьПеременнуюСреды("RUNNER_WORKSPACE", "");
КаталогФич = ОбъединитьПути(".", "features");

КаталогОтчета = ОбъединитьПути(".", "build", "reports");
ФС.ОбеспечитьКаталог(КаталогОтчета);

ПутьОтчетаJUnit = ОбъединитьПути(КаталогОтчета, "bdd-exec.xml");

ИмяКаталогаФайловПокрытия = "coverage";

Файл_КаталогФич = Новый Файл(КаталогФич);
КаталогБиблиотечныхФич = Файл_КаталогФич;

// Только для отладки Файл_КаталогФич = Новый Файл(ОбъединитьПути(КаталогФич, "ПростыеКоманды.feature"));

КаталогФайловПокрытия = ОбъединитьПути(ТекущийКаталог(), ".", ИмяКаталогаФайловПокрытия);
ФС.ОбеспечитьПустойКаталог(КаталогФайловПокрытия);

ИспользуетсяПокрытиеКода = Ложь;
Для каждого Элемент Из АргументыКоманднойСтроки Цикл
	Если Элемент = "coverage" Тогда
		ИспользуетсяПокрытиеКода = Истина;
		Прервать;
	КонецЕсли;
КонецЦикла;

ИсполнительБДД = Новый ИсполнительБДД;
Если ИспользуетсяПокрытиеКода Тогда
	ИсполнительБДД.СохранитьВКонтекст("ПризнакСтатистикиСкриптовOnescript", Новый Файл(КаталогФайловПокрытия));
КонецЕсли;

СохранитьТекущийКаталог();

РезультатВыполнения = ИсполнительБДД.ВыполнитьФичу(Файл_КаталогФич, КаталогБиблиотечныхФич);
ИтоговыйСтатусВыполнения = ИсполнительБДД.ПолучитьИтоговыйСтатусВыполнения(РезультатВыполнения);

Сообщить(ИтоговыйСтатусВыполнения);

ВосстановитьТекущийКаталог();

Если Не ПустаяСтрока(ПутьОтчетаJUnit) Тогда
    ГенераторОтчетаJUnit = Новый ГенераторОтчетаJUnit;
    ГенераторОтчетаJUnit.Сформировать(РезультатВыполнения, ИтоговыйСтатусВыполнения, ПутьОтчетаJUnit);
КонецЕсли;
