#Использовать 1bdd

КаталогФич = ОбъединитьПути(".", "features");
ПутьОтчетаJUnit = ОбъединитьПути(".", "bdd-exec.xml");

Файл_КаталогФич = Новый Файл(КаталогФич);

ИсполнительБДД = Новый ИсполнительБДД;
РезультатВыполнения = ИсполнительБДД.ВыполнитьФичу(Файл_КаталогФич, Файл_КаталогФич);
ИтоговыйСтатусВыполнения = ИсполнительБДД.ПолучитьИтоговыйСтатусВыполнения(РезультатВыполнения);

Сообщить(ИтоговыйСтатусВыполнения);

Если Не ПустаяСтрока(ПутьОтчетаJUnit) Тогда
    ГенераторОтчетаJUnit = Новый ГенераторОтчетаJUnit;
    ГенераторОтчетаJUnit.Сформировать(РезультатВыполнения, ИтоговыйСтатусВыполнения, ПутьОтчетаJUnit);
КонецЕсли;

Если ИтоговыйСтатусВыполнения = ИсполнительБДД.ВозможныеСтатусыВыполнения().Сломался Тогда
    ВызватьИсключение 1;
КонецЕсли;
