#Использовать 1testrunner

Функция ПрогнатьТесты()

	Тестер = Новый Тестер;

	РабочийКаталог = ОбъединитьПути(ТекущийСценарий().Каталог, "..", "build", "out");

	ФС.ОбеспечитьПустойКаталог(РабочийКаталог);

	ПутьКТестам = ОбъединитьПути(ТекущийСценарий().Каталог, "..", "tests", "xunits");

	ПутьКОтчетуJUnit = ОбъединитьПути(".", "build", "reports");
	ФС.ОбеспечитьКаталог(ПутьКОтчетуJUnit);

	КаталогТестов = Новый Файл(ПутьКТестам);
	Если Не КаталогТестов.Существует() Тогда
		Сообщить(СтрШаблон("Не найден каталог тестов %1", ПутьКТестам));
		Возврат Истина;
	КонецЕсли;

	РезультатТестирования = Тестер.ТестироватьКаталог(
		КаталогТестов,
		Новый Файл(ПутьКОтчетуJUnit)
	);

	Успешно = РезультатТестирования = 0;

	Возврат Успешно;

КонецФункции // ПрогнатьТесты()

// основной код

ТекКаталог = ТекущийКаталог();

Попытка
	ТестыПрошли = ПрогнатьТесты();
Исключение
	ТестыПрошли = Ложь;
	Сообщить(СтрШаблон("Тесты через 1testrunner выполнены неудачно
	|%1
	|%2", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), ОписаниеОшибки()));
КонецПопытки;

УстановитьТекущийКаталог(ТекКаталог);
