&Лог("vrunner")
Перем Лог;

&Пластилин
Перем СервисКластера;

&Пластилин
Перем СервисЗаполненияПараметров;

&НаборОпций("НаборОпцийКластера")
Перем ОпцииКластера;

&НаборОпций("НаборОпцийАдминистрирования")
Перем ОпцииАдминистрирования;

&НаборОпций("НаборОпцийПлатформы")
Перем ОпцииПлатформы;

&НаборОпций("НаборОпцийПодключения")
Перем ОпцииПодключения;

&НаборОпций("НаборОпцийНастроек")
Перем ОпцииНастроек;

&ПодкомандаПриложения(Имя = "info", Родитель = "КомандаCluster", Описание = "Получить информацию о базе данных в кластере")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ВыполнениеКоманды
Процедура ВыполнитьДействие() Экспорт

	СервисЗаполненияПараметров.Заполнить(ЭтотОбъект);

	ПараметрыКластера = Новый Структура(
		"ВерсияПлатформы, АдресRAS, АдминистраторКластера, ПарольКластера, ИдентификаторКластера, ИмяКластера, Пользователь, Пароль",
		ОпцииПлатформы.ВерсияПлатформы,
		ОпцииКластера.АдресRAS,
		ОпцииАдминистрирования.АдминистраторКластера,
		ОпцииАдминистрирования.ПарольКластера,
		ОпцииКластера.ИдентификаторКластера,
		ОпцииКластера.ИмяКластера,
		ОпцииПодключения.Пользователь,
		ОпцииПодключения.Пароль
	);

	ИБ = СервисКластера.ИнформацияОбИБ(ПараметрыКластера, ОпцииКластера.ИмяИБ);

	Сообщить("name                 : " + ИБ.Получить("name"));
	Сообщить("infobase             : " + ИБ.Получить("infobase"));
	Сообщить("dbms                 : " + ИБ.Получить("dbms"));
	Сообщить("db-server            : " + ИБ.Получить("db-server"));
	Сообщить("db-name              : " + ИБ.Получить("db-name"));
	Сообщить("sessions-deny        : " + ИБ.Получить("sessions-deny"));
	Сообщить("scheduled-jobs-deny  : " + ИБ.Получить("scheduled-jobs-deny"));
	Сообщить("license-distribution : " + ИБ.Получить("license-distribution"));

КонецПроцедуры
