// BSLLS:MissingVariablesDescription-off Поля &Опция/&Аргумент/&НаборОпций - описания заданы в самой аннотации.
// BSLLS:UnusedLocalVariable-off Поля &Опция/&Лог инициализируются autumn-фреймворком через рефлексию.
&Лог("vrunner")
Перем Лог;

&Пластилин
Перем СервисКластера;

&Пластилин
Перем СервисЗаполненияПараметров;

&НаборОпций("НаборОпцийКластера")
Перем ОпцииКластера;

&НаборОпций("НаборОпцийАдминистрирования")
Перем ОпцииАдминистрирования;

&НаборОпций("НаборОпцийПлатформы")
Перем ОпцииПлатформы;

&НаборОпций("НаборОпцийСУБД")
Перем ОпцииСУБД;

&Опция(Имя = "ib-locale", Описание = "Локализация ИБ")
&ТСтрока
&ПоУмолчанию("ru_RU")
Перем ЛокализацияИБ;

&Опция(Имя = "no-create-db", Описание = "Не создавать базу данных в СУБД")
&Флаговый
Перем НеСоздаватьБД;

&Опция(Имя = "lock-jobs", Описание = "Блокировать регламентные задания при создании")
&Флаговый
Перем БлокироватьРегламентныеЗадания;

&НаборОпций("НаборОпцийНастроек")
Перем ОпцииНастроек; // BSLLS:UnusedLocalVariable-off

&ПодкомандаПриложения(Имя = "create", Родитель = "КомандаCluster", Описание = "Создать информационную базу в кластере")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ВыполнениеКоманды
Процедура ВыполнитьДействие() Экспорт

	СервисЗаполненияПараметров.Заполнить(ЭтотОбъект);

	ПараметрыКластера = Новый Структура(
		"ВерсияПлатформы, АдресRAS, АдминистраторКластера, ПарольКластера, ИдентификаторКластера, ИмяКластера",
		ОпцииПлатформы.ВерсияПлатформы,
		ОпцииКластера.АдресRAS,
		ОпцииАдминистрирования.АдминистраторКластера,
		ОпцииАдминистрирования.ПарольКластера,
		ОпцииКластера.ИдентификаторКластера,
		ОпцииКластера.ИмяКластера);

	ПараметрыИБ = Новый Структура("ИмяИБ", ОпцииКластера.ИмяИБ);
	ПараметрыИБ.Вставить("ТипСУБД", ОпцииСУБД.ТипСУБД);
	ПараметрыИБ.Вставить("АдресСервераСУБД", ОпцииСУБД.СерверСУБД);
	ПараметрыИБ.Вставить("ИмяБазыСУБД", ОпцииСУБД.ИмяБазыДанных);
	ПараметрыИБ.Вставить("ИмяПользователяБазыСУБД", ОпцииСУБД.ПользовательСУБД);
	ПараметрыИБ.Вставить("ПарольПользователяБазыСУБД", ОпцииСУБД.ПарольСУБД);
	ПараметрыИБ.Вставить("Локализация", ЛокализацияИБ);

	Если НеСоздаватьБД = Истина Тогда
		ПараметрыИБ.Вставить("СоздаватьБДСУБД", Ложь);
	КонецЕсли;

	Если БлокироватьРегламентныеЗадания = Истина Тогда
		ПараметрыИБ.Вставить("БлокироватьРегламентныеЗадания", Истина);
	КонецЕсли;

	СервисКластера.СоздатьИБ(ПараметрыКластера, ПараметрыИБ);

КонецПроцедуры
