// BSLLS:MissingVariablesDescription-off Поля &Опция/&Аргумент/&НаборОпций - описания заданы в самой аннотации.
// BSLLS:UnusedLocalVariable-off Поля &Опция/&Лог инициализируются autumn-фреймворком через рефлексию.
&Лог("vrunner")
Перем Лог;

&Пластилин
Перем СервисКластера;

&Пластилин
Перем СервисЗаполненияПараметров;

&НаборОпций("НаборОпцийКластера")
Перем ОпцииКластера;

&НаборОпций("НаборОпцийАдминистрирования")
Перем ОпцииАдминистрирования;

&НаборОпций("НаборОпцийПлатформы")
Перем ОпцииПлатформы;

&НаборОпций("НаборОпцийПодключения")
Перем ОпцииПодключения;

&Опция(Имя = "drop-db", Описание = "Удалить базу данных в СУБД")
&Флаговый
Перем УдалитьБД;

&Опция(Имя = "clear-db", Описание = "Очистить базу данных в СУБД")
&Флаговый
Перем ОчиститьБД;

&НаборОпций("НаборОпцийНастроек")
Перем ОпцииНастроек; // BSLLS:UnusedLocalVariable-off

&ПодкомандаПриложения(Имя = "remove", Родитель = "КомандаCluster", Описание = "Удалить информационную базу из кластера")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ВыполнениеКоманды
Процедура ВыполнитьДействие() Экспорт

	СервисЗаполненияПараметров.Заполнить(ЭтотОбъект);

	ПараметрыКластера = Новый Структура(
		"ВерсияПлатформы, АдресRAS, АдминистраторКластера, ПарольКластера, ИдентификаторКластера, ИмяКластера, Пользователь, Пароль",
		ОпцииПлатформы.ВерсияПлатформы,
		ОпцииКластера.АдресRAS,
		ОпцииАдминистрирования.АдминистраторКластера,
		ОпцииАдминистрирования.ПарольКластера,
		ОпцииКластера.ИдентификаторКластера,
		ОпцииКластера.ИмяКластера,
		ОпцииПодключения.Пользователь,
		ОпцииПодключения.Пароль);

	ДействияСБД = "";
	// BSLLS:IfElseIfEndsWithElse-off
	Если УдалитьБД = Истина Тогда
		ДействияСБД = "drop";
	ИначеЕсли ОчиститьБД = Истина Тогда
		ДействияСБД = "clear";
	КонецЕсли;
	// BSLLS:IfElseIfEndsWithElse-on

	СервисКластера.УдалитьИБ(ПараметрыКластера, ОпцииКластера.ИмяИБ, ДействияСБД);

КонецПроцедуры
