// BSLLS:NumberOfValuesInStructureConstructor-off
// BSLLS:MissingVariablesDescription-off Поля &Опция/&Аргумент/&НаборОпций - описания заданы в самой аннотации.
&Лог("vrunner")
Перем Лог;

&Пластилин
Перем СервисКонфигурации;

&Пластилин
Перем СервисЗаполненияПараметров;

&Пластилин
Перем СервисОкружения;

&НаборОпций("НаборОпцийПодключения")
Перем ОпцииПодключения;

&НаборОпций("НаборОпцийПлатформы")
Перем ОпцииПлатформы;

&НаборОпций("НаборОпцийСУБД")
Перем ОпцииСУБД;

&Аргумент(Имя = "OUT", Описание = "Путь к файлу cf (*.cf)")
&ТСтрока
&ВОкружении("VRUNNER_CF_OUT")
Перем ПутьКФайлуCf;

&Опция(Имя = "s src", Описание = "Каталог исходников конфигурации (по умолчанию - текущий каталог)")
&ТСтрока
&ВОкружении("VRUNNER_SRC")
Перем КаталогИсходников;

&Опция(Имя = "list", Описание = "Список файлов для выборочной загрузки")
&ТСтрока
Перем СписокФайлов;

&НаборОпций("НаборОпцийИсходников")
Перем ОпцииИсходников;

&НаборОпций("НаборОпцийНастроек")
Перем ОпцииНастроек; // BSLLS:UnusedLocalVariable-off

&ПодкомандаПриложения(Имя = "compile", Родитель = "КомандаCf", Описание = "Собрать конфигурацию из исходников")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ВыполнениеКоманды
Процедура ВыполнитьДействие() Экспорт

	СервисЗаполненияПараметров.Заполнить(ЭтотОбъект);

	КаталогSrc = КаталогИсходниковИлиТекущий();

	Лог.Отладка("Начало выполнения команды cf compile");
	Лог.Отладка("Каталог исходников: %1", КаталогSrc);
	Лог.Отладка("Путь к файлу cf: %1", ПутьКФайлуCf);
	Лог.Отладка("Использовать ibcmd: %1", Формат(ОпцииПодключения.ИспользоватьIbcmd, "БЛ=Ложь; БИ=Истина"));

	ПараметрыПлатформы = Новый Структура(
		"ВерсияПлатформы, КодРазрешения, Язык, Локаль",
		ОпцииПлатформы.ВерсияПлатформы,
		ОпцииПлатформы.КодРазрешения,
		ОпцииПлатформы.Язык,
		ОпцииПлатформы.Локаль);

	ПараметрыПодключения = Неопределено;
	Если ЗначениеЗаполнено(ОпцииПодключения.СтрокаПодключения)
		ИЛИ ЗначениеЗаполнено(ОпцииСУБД.ТипСУБД) Тогда
		ПараметрыПодключения = Новый Структура(
			"СтрокаПодключения, Пользователь, Пароль",
			ОпцииПодключения.СтрокаПодключения,
			ОпцииПодключения.Пользователь,
			ОпцииПодключения.Пароль);
		ОпцииСУБД.ДополнитьПараметрыПодключения(ПараметрыПодключения);
	КонецЕсли;

	СервисКонфигурации.СобратьВФайлCf(
		КаталогSrc,
		ПутьКФайлуCf,
		ОпцииПодключения.ИспользоватьIbcmd,
		ПараметрыПлатформы,
		СписокФайлов,
		ПараметрыПодключения,
		ОпцииИсходников.СформироватьПараметрыИсходников());

КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

Функция КаталогИсходниковИлиТекущий()

	Если ЗначениеЗаполнено(КаталогИсходников) Тогда
		Возврат КаталогИсходников;
	КонецЕсли;

	Возврат СервисОкружения.РабочийКаталог();

КонецФункции

#КонецОбласти
