#Использовать tempfiles

#Область ОписаниеПеременных

Перем ТекстовыйДокумент; // Экземпляр документа для хренения лога вывода.

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Возвращает вывод лога
//
//  Возвращаемое значение:
//   Строка - Сожержимое лога
//
Функция ВыводЛога() Экспорт
	Возврат ТекстовыйДокумент.ПолучитьТекст();
КонецФункции

#КонецОбласти

#Область InterfaceImplementaion

Процедура ВывестиСобытие(Знач СобытиеЛога) Экспорт
	
	Сообщение = СобытиеЛога.ПолучитьФорматированноеСообщение();
	ТекстовыйДокумент.ДобавитьСтроку(Сообщение);
	Консоль.ВывестиСтроку(Сообщение);

КонецПроцедуры

Процедура Закрыть() Экспорт
КонецПроцедуры

// Устанавливает свойство аппендера, заданное в конфигурационном файле
//
// Параметры:
//   ИмяСвойства - Строка - Имя свойства
//   Значение - Строка, Число, Булево - Значение свойства
//
Процедура УстановитьСвойство(Знач ИмяСвойства, Знач Значение) Экспорт
КонецПроцедуры // УстановитьСвойство()

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриСозданииОбъекта()
	ТекстовыйДокумент = Новый ТекстовыйДокумент();
КонецПроцедуры

#КонецОбласти
