#Использовать tempfiles

Перем ТекстовыйДокумент;

#Область ПрограммныйИнтерфейс

Функция ВыводЛога() Экспорт
	Возврат ТекстовыйДокумент.ПолучитьТекст();
КонецФункции

#КонецОбласти

#Область InterfaceImplementaion

Процедура ВывестиСобытие(Знач СобытиеЛога) Экспорт
	
	Сообщение = СобытиеЛога.ПолучитьФорматированноеСообщение();
	ТекстовыйДокумент.ДобавитьСтроку(Сообщение);

КонецПроцедуры

Процедура Закрыть() Экспорт
КонецПроцедуры

// Устанавливает свойство аппендера, заданное в конфигурационном файле
//
Процедура УстановитьСвойство(Знач ИмяСвойства, Знач Значение) Экспорт
КонецПроцедуры // УстановитьСвойство()

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриСозданииОбъекта()
	ТекстовыйДокумент = Новый ТекстовыйДокумент();
КонецПроцедуры

#КонецОбласти
