// BSLLS:LineLength-off
// BSLLS:NumberOfValuesInStructureConstructor-off
// BSLLS:MissingVariablesDescription-off Поля &Опция/&Аргумент/&НаборОпций - описания заданы в самой аннотации.
// BSLLS:UnusedLocalVariable-off Поля &Опция/&Лог инициализируются autumn-фреймворком через рефлексию.
&Лог("vrunner")
Перем Лог;

&Пластилин
Перем СервисКластера;

&Пластилин
Перем СервисЗаполненияПараметров;

&НаборОпций("НаборОпцийКластера")
Перем ОпцииКластера;

&НаборОпций("НаборОпцийАдминистрирования")
Перем ОпцииАдминистрирования;

&НаборОпций("НаборОпцийПлатформы")
Перем ОпцииПлатформы;

&НаборОпций("НаборОпцийАутентификацииИБ")
Перем ОпцииАутентификации;

&НаборОпций("НаборОпцийНастроек")
Перем ОпцииНастроек; // BSLLS:UnusedLocalVariable-off

&ПодкомандаПриложения(Имя = "unlock", Родитель = "ПодкомандаClusterSession", Описание = "Разблокировать новые сеансы")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ВыполнениеКоманды
Процедура ВыполнитьДействие() Экспорт

	СервисЗаполненияПараметров.Заполнить(ЭтотОбъект);

	ПараметрыКластера = Новый Структура(
		"ВерсияПлатформы, АдресRAS, АдминистраторКластера, ПарольКластера, ИдентификаторКластера, ИмяКластера, Пользователь, Пароль",
		ОпцииПлатформы.ВерсияПлатформы,
		ОпцииКластера.АдресRAS,
		ОпцииАдминистрирования.АдминистраторКластера,
		ОпцииАдминистрирования.ПарольКластера,
		ОпцииКластера.ИдентификаторКластера,
		ОпцииКластера.ИмяКластера,
		ОпцииАутентификации.Пользователь,
		ОпцииАутентификации.Пароль);

	СервисКластера.РазблокироватьСеансы(ПараметрыКластера, ОпцииКластера.ИмяИБ);

КонецПроцедуры
