// BSLLS:LineLength-off
// BSLLS:NumberOfValuesInStructureConstructor-off
// BSLLS:MissingVariablesDescription-off Поля &Опция/&Аргумент/&НаборОпций - описания заданы в самой аннотации.
// BSLLS:UnusedLocalVariable-off Поля &Опция/&Лог инициализируются autumn-фреймворком через рефлексию.
&Лог("vrunner")
Перем Лог;

&Пластилин
Перем СервисКластера;

&Пластилин
Перем СервисЗаполненияПараметров;

&НаборОпций("НаборОпцийКластера")
Перем ОпцииКластера;

&НаборОпций("НаборОпцийАдминистрирования")
Перем ОпцииАдминистрирования;

&НаборОпций("НаборОпцийПлатформы")
Перем ОпцииПлатформы;

&НаборОпций("НаборОпцийПодключения")
Перем ОпцииПодключения;

&Опция(Имя = "no-lock", Описание = "Не блокировать новые сеансы перед завершением")
&Флаговый
Перем НеБлокировать;

&НаборОпций("НаборОпцийНастроек")
Перем ОпцииНастроек; // BSLLS:UnusedLocalVariable-off

&ПодкомандаПриложения(Имя = "kill", Родитель = "ПодкомандаClusterSession", Описание = "Завершить текущие сеансы")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ВыполнениеКоманды
Процедура ВыполнитьДействие() Экспорт

	СервисЗаполненияПараметров.Заполнить(ЭтотОбъект);

	ПараметрыКластера = Новый Структура(
		"ВерсияПлатформы, АдресRAS, АдминистраторКластера, ПарольКластера, ИдентификаторКластера, ИмяКластера, Пользователь, Пароль",
		ОпцииПлатформы.ВерсияПлатформы,
		ОпцииКластера.АдресRAS,
		ОпцииАдминистрирования.АдминистраторКластера,
		ОпцииАдминистрирования.ПарольКластера,
		ОпцииКластера.ИдентификаторКластера,
		ОпцииКластера.ИмяКластера,
		ОпцииПодключения.Пользователь,
		ОпцииПодключения.Пароль);

	БлокироватьНовые = Истина;
	Если НеБлокировать = Истина Тогда
		БлокироватьНовые = Ложь;
	КонецЕсли;

	СервисКластера.ЗавершитьСеансы(ПараметрыКластера, ОпцииКластера.ИмяИБ, БлокироватьНовые);

КонецПроцедуры
