// BSLLS:MissingVariablesDescription-off Поля &Опция/&Аргумент/&НаборОпций - описания заданы в самой аннотации.
&Лог("vrunner")
Перем Лог;

&Пластилин
Перем СервисПлатформы;

&Пластилин
Перем СервисЗаполненияПараметров;

&НаборОпций("НаборОпцийПодключения")
Перем ОпцииПодключения;

&НаборОпций("НаборОпцийПлатформы")
Перем ОпцииПлатформы;

&НаборОпций("НаборОпцийХранилища")
Перем ОпцииХранилища;

&Опция(Имя = "no-wait", Описание = "Не ожидать завершения запущенной команды/действия")
&Флаговый
Перем НеОжидать;

&Опция(Имя = "additional", Описание = "Дополнительные параметры запуска конфигуратора")
&ТСтрока
&ВОкружении("VRUNNER_ADDITIONAL")
Перем ДополнительныеПараметры;

&НаборОпций("НаборОпцийНастроек")
Перем ОпцииНастроек; // BSLLS:UnusedLocalVariable-off

&ПодкомандаПриложения(Имя = "designer", Родитель = "КомандаRun", Описание = "Запустить конфигуратор")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ВыполнениеКоманды
Процедура ВыполнитьДействие() Экспорт

	СервисЗаполненияПараметров.Заполнить(ЭтотОбъект);

	Лог.Отладка("Начало выполнения команды run designer");

	ПараметрыПлатформы = ОпцииПлатформы.СформироватьПараметрыПлатформы();

	ПараметрыПодключения = ОпцииПодключения.ПараметрыПодключения();

	ПараметрыХранилища = ОпцииХранилища.ПараметрыХранилищаЕслиЗаданы();

	ПараметрыЗапуска = Новый Структура;
	ПараметрыЗапуска.Вставить("НеОжидать", НеОжидать);
	ПараметрыЗапуска.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);
	ПараметрыЗапуска.Вставить("ПараметрыХранилища", ПараметрыХранилища);

	СервисПлатформы.ЗапуститьКонфигуратор(ПараметрыПодключения, ПараметрыЗапуска, ПараметрыПлатформы);

КонецПроцедуры
