// BSLLS:NumberOfValuesInStructureConstructor-off
// BSLLS:MissingVariablesDescription-off Поля &Опция/&Аргумент/&НаборОпций - описания заданы в самой аннотации.
&Лог("vrunner")
Перем Лог;

&Пластилин
Перем СервисХранилища;

&Пластилин
Перем СервисЗаполненияПараметров;

&НаборОпций("НаборОпцийПодключения")
Перем ОпцииПодключения;

&НаборОпций("НаборОпцийПлатформы")
Перем ОпцииПлатформы;

&НаборОпций("НаборОпцийСУБД")
Перем ОпцииСУБД;

&НаборОпций("НаборОпцийХранилища")
Перем ОпцииХранилища;

&Опция(Имя = "objects", Описание = "Путь к файлу XML со списком объектов")
&ТСтрока
Перем ПутьКФайлуОбъектов;

&Опция(Имя = "force", Описание = "Игнорировать локальные изменения")
&Флаговый
Перем ИгнорироватьИзменения;

&НаборОпций("НаборОпцийНастроек")
Перем ОпцииНастроек; // BSLLS:UnusedLocalVariable-off

&ПодкомандаПриложения(Имя = "unlock", Родитель = "КомандаRepo", Описание = "Отпустить объекты в хранилище")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ВыполнениеКоманды
Процедура ВыполнитьДействие() Экспорт

	СервисЗаполненияПараметров.Заполнить(ЭтотОбъект);

	Лог.Отладка("Начало выполнения команды repo unlock");

	ПараметрыПлатформы = Новый Структура(
		"ВерсияПлатформы, КодРазрешения, Язык, Локаль",
		ОпцииПлатформы.ВерсияПлатформы,
		ОпцииПлатформы.КодРазрешения,
		ОпцииПлатформы.Язык,
		ОпцииПлатформы.Локаль);

	ПараметрыПодключения = Новый Структура(
		"СтрокаПодключения, Пользователь, Пароль",
		ОпцииПодключения.СтрокаПодключения,
		ОпцииПодключения.Пользователь,
		ОпцииПодключения.Пароль);
	ОпцииСУБД.ДополнитьПараметрыПодключения(ПараметрыПодключения);

	ПараметрыХранилища = Новый Структура(
		"АдресХранилища, Пользователь, Пароль, Версия",
		ОпцииХранилища.АдресХранилища,
		ОпцииХранилища.ПользовательХранилища,
		ОпцииХранилища.ПарольХранилища,
		ОпцииХранилища.ВерсияХранилища);

	СервисХранилища.ОтпуститьОбъектыВХранилище(
		ПараметрыПодключения,
		ПараметрыХранилища,
		ПутьКФайлуОбъектов,
		ИгнорироватьИзменения = Истина,
		ПараметрыПлатформы);

КонецПроцедуры
