// BSLLS:MissingVariablesDescription-off Поля &Опция/&Аргумент/&НаборОпций - описания заданы в самой аннотации.
&Лог("vrunner")
Перем Лог;

&Пластилин
Перем СервисХранилища;

&Пластилин
Перем СервисЗаполненияПараметров;

&НаборОпций("НаборОпцийПодключения")
Перем ОпцииПодключения;

&НаборОпций("НаборОпцийПлатформы")
Перем ОпцииПлатформы;

&НаборОпций("НаборОпцийСУБД")
Перем ОпцииСУБД;

&НаборОпций("НаборОпцийХранилища")
Перем ОпцииХранилища;

&Опция(Имя = "new-user-name", Описание = "Логин нового пользователя хранилища")
&ТСтрока
&Обязательный
Перем ЛогинПользователя;

&Опция(Имя = "new-user-pwd", Описание = "Пароль нового пользователя хранилища")
&ТСтрока
Перем ПарольПользователя;

&Опция(Имя = "new-user-role", Описание = "Роль пользователя хранилища")
&ТПеречисление
&Перечисление(Имя = "ReadOnly", Описание = "Только чтение")
&Перечисление(Имя = "LockObjects", Описание = "Захват объектов")
&Перечисление(Имя = "ManageConfigurationVersions", Описание = "Управление версиями конфигурации")
&Перечисление(Имя = "Administration", Описание = "Административные права")
Перем РольПользователя;

&НаборОпций("НаборОпцийНастроек")
Перем ОпцииНастроек; // BSLLS:UnusedLocalVariable-off

&ПодкомандаПриложения(Имя = "create-user", Родитель = "КомандаRepo", Описание = "Создать пользователя хранилища")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ВыполнениеКоманды
Процедура ВыполнитьДействие() Экспорт

	СервисЗаполненияПараметров.Заполнить(ЭтотОбъект);

	Лог.Отладка("Начало выполнения команды repo create-user");

	ПараметрыПлатформы = Новый Структура(
		"ВерсияПлатформы, КодРазрешения, Язык, Локаль",
		ОпцииПлатформы.ВерсияПлатформы,
		ОпцииПлатформы.КодРазрешения,
		ОпцииПлатформы.Язык,
		ОпцииПлатформы.Локаль);

	ПараметрыПодключения = Неопределено;
	Если ЗначениеЗаполнено(ОпцииПодключения.СтрокаПодключения) Тогда
		ПараметрыПодключения = Новый Структура(
			"СтрокаПодключения, Пользователь, Пароль",
			ОпцииПодключения.СтрокаПодключения,
			ОпцииПодключения.Пользователь,
			ОпцииПодключения.Пароль);
		ОпцииСУБД.ДополнитьПараметрыПодключения(ПараметрыПодключения);
	КонецЕсли;

	ПараметрыХранилища = Новый Структура(
		"АдресХранилища, Пользователь, Пароль, Версия",
		ОпцииХранилища.АдресХранилища,
		ОпцииХранилища.ПользовательХранилища,
		ОпцииХранилища.ПарольХранилища,
		ОпцииХранилища.ВерсияХранилища);

	СервисХранилища.СоздатьПользователяХранилища(
		ПараметрыХранилища,
		ЛогинПользователя,
		ПарольПользователя,
		РольПользователя,
		ПараметрыПлатформы,
		ПараметрыПодключения);

КонецПроцедуры
