// BSLLS:NumberOfValuesInStructureConstructor-off
// BSLLS:MissingVariablesDescription-off Поля &Опция/&Аргумент/&НаборОпций - описания заданы в самой аннотации.
&Лог("vrunner")
Перем Лог;

&Пластилин
Перем СервисХранилища;

&Пластилин
Перем СервисЗаполненияПараметров;

&НаборОпций("НаборОпцийПодключения")
Перем ОпцииПодключения;

&НаборОпций("НаборОпцийПлатформы")
Перем ОпцииПлатформы;

&НаборОпций("НаборОпцийСУБД")
Перем ОпцииСУБД;

&НаборОпций("НаборОпцийХранилища")
Перем ОпцииХранилища;

&Опция(Имя = "ignore-already-bound", Описание = "Игнорировать наличие подключенного пользователя")
&Флаговый
Перем ИгнорироватьНаличиеПодключеннойБД;

&Опция(Имя = "do-not-replace-cfg", Описание = "Не заменять конфигурацию БД конфигурацией хранилища")
&Флаговый
Перем НеЗаменятьКонфигурациюБД;

&НаборОпций("НаборОпцийНастроек")
Перем ОпцииНастроек; // BSLLS:UnusedLocalVariable-off

&ПодкомандаПриложения(Имя = "bind", Родитель = "КомандаRepo", Описание = "Подключиться к хранилищу конфигурации")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ВыполнениеКоманды
Процедура ВыполнитьДействие() Экспорт

	СервисЗаполненияПараметров.Заполнить(ЭтотОбъект);

	Лог.Отладка("Начало выполнения команды repo bind");

	ПараметрыПлатформы = Новый Структура(
		"ВерсияПлатформы, КодРазрешения, Язык, Локаль",
		ОпцииПлатформы.ВерсияПлатформы,
		ОпцииПлатформы.КодРазрешения,
		ОпцииПлатформы.Язык,
		ОпцииПлатформы.Локаль);

	ПараметрыПодключения = Новый Структура(
		"СтрокаПодключения, Пользователь, Пароль",
		ОпцииПодключения.СтрокаПодключения,
		ОпцииПодключения.Пользователь,
		ОпцииПодключения.Пароль);
	ОпцииСУБД.ДополнитьПараметрыПодключения(ПараметрыПодключения);

	ПараметрыХранилища = Новый Структура(
		"АдресХранилища, Пользователь, Пароль, Версия",
		ОпцииХранилища.АдресХранилища,
		ОпцииХранилища.ПользовательХранилища,
		ОпцииХранилища.ПарольХранилища,
		ОпцииХранилища.ВерсияХранилища);

	ЗаменитьКонфигурациюБД = НЕ (НеЗаменятьКонфигурациюБД = Истина);

	СервисХранилища.ПодключитьсяКХранилищу(
		ПараметрыПодключения,
		ПараметрыХранилища,
		ИгнорироватьНаличиеПодключеннойБД = Истина,
		ЗаменитьКонфигурациюБД,
		ПараметрыПлатформы);

КонецПроцедуры
