// BSLLS:MissingVariablesDescription-off Поля &Опция/&Аргумент/&НаборОпций - описания заданы в самой аннотации.
&Лог("vrunner")
Перем Лог;

&Пластилин
Перем СервисХранилища;

&Пластилин
Перем СервисЗаполненияПараметров;

&НаборОпций("НаборОпцийПодключения")
Перем ОпцииПодключения;

&НаборОпций("НаборОпцийПлатформы")
Перем ОпцииПлатформы;

&НаборОпций("НаборОпцийСУБД")
Перем ОпцииСУБД;

&НаборОпций("НаборОпцийХранилища")
Перем ОпцииХранилища;

&Опция(Имя = "source-storage-name", Описание = "Адрес хранилища-источника для копирования пользователей")
&ТСтрока
&Обязательный
Перем АдресХранилищаИсточника;

&Опция(Имя = "source-storage-user", Описание = "Пользователь хранилища-источника")
&ТСтрока
Перем ПользовательИсточника;

&Опция(Имя = "source-storage-pwd", Описание = "Пароль хранилища-источника")
&ТСтрока
Перем ПарольИсточника;

&Опция(Имя = "restore-deleted", Описание = "Восстановить удаленных пользователей")
&Флаговый
Перем ВосстановитьУдаленного;

&НаборОпций("НаборОпцийНастроек")
Перем ОпцииНастроек; // BSLLS:UnusedLocalVariable-off

&ПодкомандаПриложения(Имя = "copy-user", Родитель = "КомандаRepo", Описание = "Копировать пользователей хранилища")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ВыполнениеКоманды
Процедура ВыполнитьДействие() Экспорт

	СервисЗаполненияПараметров.Заполнить(ЭтотОбъект);

	Лог.Отладка("Начало выполнения команды repo copy-user");

	ПараметрыПлатформы = Новый Структура(
		"ВерсияПлатформы, КодРазрешения, Язык, Локаль",
		ОпцииПлатформы.ВерсияПлатформы,
		ОпцииПлатформы.КодРазрешения,
		ОпцииПлатформы.Язык,
		ОпцииПлатформы.Локаль);

	ПараметрыПодключения = Неопределено;
	Если ЗначениеЗаполнено(ОпцииПодключения.СтрокаПодключения) Тогда
		ПараметрыПодключения = Новый Структура(
			"СтрокаПодключения, Пользователь, Пароль",
			ОпцииПодключения.СтрокаПодключения,
			ОпцииПодключения.Пользователь,
			ОпцииПодключения.Пароль);
		ОпцииСУБД.ДополнитьПараметрыПодключения(ПараметрыПодключения);
	КонецЕсли;

	ПараметрыХранилища = Новый Структура(
		"АдресХранилища, Пользователь, Пароль, Версия",
		ОпцииХранилища.АдресХранилища,
		ОпцииХранилища.ПользовательХранилища,
		ОпцииХранилища.ПарольХранилища,
		ОпцииХранилища.ВерсияХранилища);

	СервисХранилища.КопироватьПользователейИзХранилища(
		ПараметрыХранилища,
		АдресХранилищаИсточника,
		ПользовательИсточника,
		ПарольИсточника,
		ВосстановитьУдаленного = Истина,
		ПараметрыПлатформы,
		ПараметрыПодключения);

КонецПроцедуры
