&Лог("vrunner")
Перем Лог;

&Пластилин
Перем СервисХранилища;

&Пластилин
Перем СервисЗаполненияПараметров;

&НаборОпций("НаборОпцийПодключения")
Перем ОпцииПодключения;

&НаборОпций("НаборОпцийПлатформы")
Перем ОпцииПлатформы;

&НаборОпций("НаборОпцийСУБД")
Перем ОпцииСУБД;

&НаборОпций("НаборОпцийХранилища")
Перем ОпцииХранилища;

&Опция(Имя = "objects", Описание = "Путь к файлу XML со списком объектов")
&ТСтрока
Перем ПутьКФайлуОбъектов;

&Опция(Имя = "comment", Описание = "Комментарий к помещаемым объектам")
&ТСтрока
Перем Комментарий;

&Опция(Имя = "keep-locked", Описание = "Оставить объекты захваченными после помещения")
&Флаговый
Перем ОставитьЗахваченными;

&Опция(Имя = "force", Описание = "Игнорировать удалённые объекты")
&Флаговый
Перем ИгнорироватьУдалённые;

&НаборОпций("НаборОпцийНастроек")
Перем ОпцииНастроек;

&ПодкомандаПриложения(Имя = "commit", Родитель = "КомандаRepo", Описание = "Поместить изменения в хранилище")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ВыполнениеКоманды
Процедура ВыполнитьДействие() Экспорт

	СервисЗаполненияПараметров.Заполнить(ЭтотОбъект);

	Лог.Отладка("Начало выполнения команды repo commit");

	ПараметрыПлатформы = Новый Структура(
		"ВерсияПлатформы, КодРазрешения, Язык, Локаль",
		ОпцииПлатформы.ВерсияПлатформы,
		ОпцииПлатформы.КодРазрешения,
		ОпцииПлатформы.Язык,
		ОпцииПлатформы.Локаль
	);

	ПараметрыПодключения = Новый Структура(
		"СтрокаПодключения, Пользователь, Пароль",
		ОпцииПодключения.СтрокаПодключения,
		ОпцииПодключения.Пользователь,
		ОпцииПодключения.Пароль
	);
	ОпцииСУБД.ДополнитьПараметрыПодключения(ПараметрыПодключения);

	ПараметрыХранилища = Новый Структура(
		"АдресХранилища, Пользователь, Пароль, Версия",
		ОпцииХранилища.АдресХранилища,
		ОпцииХранилища.ПользовательХранилища,
		ОпцииХранилища.ПарольХранилища,
		ОпцииХранилища.ВерсияХранилища
	);

	СервисХранилища.ПоместитьИзмененияВХранилище(
		ПараметрыПодключения,
		ПараметрыХранилища,
		ПутьКФайлуОбъектов,
		Комментарий,
		ОставитьЗахваченными = Истина,
		ИгнорироватьУдалённые = Истина,
		ПараметрыПлатформы
	);

КонецПроцедуры
