// BSLLS:MissingVariablesDescription-off Поля &Опция/&Аргумент/&НаборОпций - описания заданы в самой аннотации.
&Лог("vrunner")
Перем Лог;

&Пластилин
Перем СервисПлатформы;

&Пластилин
Перем СервисЗаполненияПараметров;

&НаборОпций("НаборОпцийПодключения")
Перем ОпцииПодключения;

&НаборОпций("НаборОпцийПлатформы")
Перем ОпцииПлатформы;

&НаборОпций("НаборОпцийСУБД")
Перем ОпцииСУБД;

&Аргумент(Имя = "OUT", Описание = "Путь к выходному файлу DT (*.dt)")
&ТСтрока
&Обязательный
Перем ПутьКФайлуDT;

&НаборОпций("НаборОпцийНастроек")
Перем ОпцииНастроек; // BSLLS:UnusedLocalVariable-off

&ПодкомандаПриложения(Имя = "dump-dt", Родитель = "КомандаInfobase", Описание = "Выгрузить информационную базу в файл dt")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ВыполнениеКоманды
Процедура ВыполнитьДействие() Экспорт

	СервисЗаполненияПараметров.Заполнить(ЭтотОбъект);

	Лог.Отладка("Начало выполнения команды infobase dump-dt");

	ПараметрыПлатформыСтр = Новый Структура(
		"ВерсияПлатформы, КодРазрешения, Язык, Локаль",
		ОпцииПлатформы.ВерсияПлатформы,
		ОпцииПлатформы.КодРазрешения,
		ОпцииПлатформы.Язык,
		ОпцииПлатформы.Локаль);

	ПараметрыПодключения = Новый Структура(
		"СтрокаПодключения, Пользователь, Пароль",
		ОпцииПодключения.СтрокаПодключения,
		ОпцииПодключения.Пользователь,
		ОпцииПодключения.Пароль);
	ОпцииСУБД.ДополнитьПараметрыПодключения(ПараметрыПодключения);

	Если НЕ ЗначениеЗаполнено(ОпцииПодключения.СтрокаПодключения) Тогда
		ВызватьИсключение "Не указана строка подключения к информационной базе (--ibconnection)";
	КонецЕсли;

	СервисПлатформы.ВыгрузитьИнфобазуВФайл(
		ПараметрыПодключения,
		ПутьКФайлуDT,
		ОпцииПодключения.ИспользоватьIbcmd,
		ПараметрыПлатформыСтр);

КонецПроцедуры
