// BSLLS:LineLength-off

&Желудь("ОписаниеКонсольногоПриложения")
&Верховный
Процедура ПриСозданииОбъекта()
КонецПроцедуры

Функция ИмяПриложения() Экспорт
	Возврат "vrunner";
КонецФункции

Функция ПолноеИмяПриложения() Экспорт
	Возврат "Это ранний предрелизный билд 3.0.0 для тестирования и отладки. Не предназначен для использования в продакшене.
| Если вы столкнулись с багом, или вам чего-то не хватает, то обязательно напишите ишуз сюда: https://github.com/vanessa-opensource/vanessa-runner/issues";
КонецФункции

Функция ВерсияПриложения() Экспорт
	Возврат "3.0.0_beta";
КонецФункции