
&Желудь("ОписаниеКонсольногоПриложения")
&Верховный
Процедура ПриСозданииОбъекта()
КонецПроцедуры

Функция ИмяПриложения() Экспорт
	Возврат "vrunner3";
КонецФункции

Функция ПолноеИмяПриложения() Экспорт
	Возврат "Это ранний предрелизный билд 3.0.0 для тестирования и отладки. Не предназначен для использования в продакшене.
| Скорее всего тут ничего не работает!
| Если вы столкнулись с багом, или вам чего-то не хватает, то обязательно напишите ишуз сюда: https://github.com/Segate-ekb/vanessa-runner/issues";
КонецФункции

Функция ВерсияПриложения() Экспорт
	Возврат "3.0.0_preAlpha";
КонецФункции