&Лог("vrunner")
Перем Лог;

&Пластилин
Перем СервисКластера;

&Пластилин
Перем СервисЗаполненияПараметров;

&НаборОпций("НаборОпцийКластера")
Перем ОпцииКластера;

&НаборОпций("НаборОпцийАдминистрирования")
Перем ОпцииАдминистрирования;

&НаборОпций("НаборОпцийПлатформы")
Перем ОпцииПлатформы;

&НаборОпций("НаборОпцийПодключения")
Перем ОпцииПодключения;

&НаборОпций("НаборОпцийНастроек")
Перем ОпцииНастроек;

&ПодкомандаПриложения(Имя = "lock", Родитель = "ПодкомандаClusterJobs", Описание = "Заблокировать регламентные задания")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ВыполнениеКоманды
Процедура ВыполнитьДействие() Экспорт

	СервисЗаполненияПараметров.Заполнить(ЭтотОбъект);

	ПараметрыКластера = Новый Структура(
		"ВерсияПлатформы, АдресRAS, АдминистраторКластера, ПарольКластера, ИдентификаторКластера, ИмяКластера, Пользователь, Пароль",
		ОпцииПлатформы.ВерсияПлатформы,
		ОпцииКластера.АдресRAS,
		ОпцииАдминистрирования.АдминистраторКластера,
		ОпцииАдминистрирования.ПарольКластера,
		ОпцииКластера.ИдентификаторКластера,
		ОпцииКластера.ИмяКластера,
		ОпцииПодключения.Пользователь,
		ОпцииПодключения.Пароль
	);

	СервисКластера.ЗаблокироватьРегламентныеЗадания(ПараметрыКластера, ОпцииКластера.ИмяИБ);

КонецПроцедуры
