// BSLLS:MissingVariablesDescription-off
// Билдер ДвижокКонфигуратор для юнит-тестов с инжекцией фабрики УправлениеКонфигуратором.

#Использовать reflector
#Использовать logos
#Использовать "../../../../src/core/Файлы"
#Использовать "../../../../src/core/Движки"
#Использовать "../../../../src/core/Процессы"

Перем _Фабрика;

Процедура ПриСозданииОбъекта()
	_Фабрика = Неопределено;
КонецПроцедуры

Функция СФабрикойКонфигуратора(Фабрика) Экспорт
	_Фабрика = Фабрика;
	Возврат ЭтотОбъект;
КонецФункции

Функция Собрать() Экспорт

	Движок = Новый ДвижокКонфигуратор;

	Рефлектор = Новый Рефлектор;
	Рефлектор.УстановитьСвойство(Движок, "Лог", Логирование.ПолучитьЛог("vrunner"));
	Рефлектор.УстановитьСвойство(Движок, "ФайловыеОперации", Новый ФайловыеОперации);
	Рефлектор.УстановитьСвойство(Движок, "_ФабрикаКонфигуратора", _Фабрика);
	Рефлектор.УстановитьСвойство(Движок, "СервисПроцессов", НовыйСервисПроцессов(Рефлектор));

	Возврат Движок;

КонецФункции

Функция НовыйСервисПроцессов(Рефлектор)
	Сервис = Новый СервисПроцессов;
	Рефлектор.УстановитьСвойство(Сервис, "Лог", Логирование.ПолучитьЛог("vrunner"));
	Возврат Сервис;
КонецФункции
