// BSLLS:MissingVariablesDescription-off
// BSLLS:LatinAndCyrillicSymbolInWord-off
// Билдер СервисYAxUnit для юнит-тестов.
// Внедряет мок СервисПлатформы через Рефлектор.

#Использовать reflector
#Использовать logos
#Использовать "../../../../src/core/Файлы"
#Использовать "../../../../src/core/Сервисы"

Перем _СервисПлатформы;

Процедура ПриСозданииОбъекта()
	_СервисПлатформы = Неопределено;
КонецПроцедуры

Функция СПлатформой(Сервис) Экспорт
	_СервисПлатформы = Сервис;
	Возврат ЭтотОбъект;
КонецФункции

Функция Собрать() Экспорт

	Сервис = Новый СервисYAxUnit;

	Рефлектор = Новый Рефлектор;
	Рефлектор.УстановитьСвойство(Сервис, "Лог", Логирование.ПолучитьЛог("vrunner"));
	Рефлектор.УстановитьСвойство(Сервис, "ФайловыеОперации", Новый ФайловыеОперации);
	Рефлектор.УстановитьСвойство(Сервис, "СервисПлатформы", _СервисПлатформы);

	Возврат Сервис;

КонецФункции
