// BSLLS:MissingVariablesDescription-off
// Билдер для сборки СервисЗапускаОбработок в юнит-тестах.

#Использовать reflector
#Использовать logos
#Использовать "../../../../src/core/Сервисы"

Перем _Движки;
Перем _СервисОкружения;

Процедура ПриСозданииОбъекта()
	_Движки = Новый Соответствие;
	_СервисОкружения = Неопределено;
КонецПроцедуры

Функция СДвижкомКонфигуратор(Движок) Экспорт
	_Движки.Вставить("ДвижокКонфигуратор", Движок);
	Возврат ЭтотОбъект;
КонецФункции

Функция СОкружением(Сервис) Экспорт
	_СервисОкружения = Сервис;
	Возврат ЭтотОбъект;
КонецФункции

Функция Собрать() Экспорт

	Сервис = Новый СервисЗапускаОбработок;

	Рефлектор = Новый Рефлектор;
	Рефлектор.УстановитьСвойство(Сервис, "Движки", _Движки);
	Рефлектор.УстановитьСвойство(Сервис, "Лог", Логирование.ПолучитьЛог("vrunner"));
	Рефлектор.УстановитьСвойство(Сервис, "СервисОкружения", _СервисОкружения);

	Возврат Сервис;

КонецФункции
