// BSLLS:MissingVariablesDescription-off
// Билдер для сборки СервисEDT в юнит-тестах с подменой фабрик команды и поиска EDT.

#Использовать reflector
#Использовать logos
#Использовать "../../../../src/core/Сервисы"

Перем _ФабрикаКоманды;
Перем _ФабрикаПоискаEDT;

Процедура ПриСозданииОбъекта()
	_ФабрикаКоманды = Неопределено;
	_ФабрикаПоискаEDT = Неопределено;
КонецПроцедуры

Функция СФабрикойКоманды(Фабрика) Экспорт
	_ФабрикаКоманды = Фабрика;
	Возврат ЭтотОбъект;
КонецФункции

Функция СФабрикойПоискаEDT(Фабрика) Экспорт
	_ФабрикаПоискаEDT = Фабрика;
	Возврат ЭтотОбъект;
КонецФункции

Функция Собрать() Экспорт

	Сервис = Новый СервисEDT;

	Рефлектор = Новый Рефлектор;
	Рефлектор.УстановитьСвойство(Сервис, "Лог", Логирование.ПолучитьЛог("vrunner"));
	Рефлектор.УстановитьСвойство(Сервис, "_ФабрикаКоманды", _ФабрикаКоманды);
	Рефлектор.УстановитьСвойство(Сервис, "_ФабрикаПоискаEDT", _ФабрикаПоискаEDT);

	Возврат Сервис;

КонецФункции
