// BSLLS:MissingVariablesDescription-off
// Билдер для сборки СервисОбработок в юнит-тестах с моками движков.

#Использовать reflector
#Использовать logos
#Использовать "../../../../src/core/Сервисы"

Перем _Движки;

Процедура ПриСозданииОбъекта()
	_Движки = Новый Соответствие;
КонецПроцедуры

Функция СДвижкомКонфигуратор(Движок) Экспорт
	_Движки.Вставить("ДвижокКонфигуратор", Движок);
	Возврат ЭтотОбъект;
КонецФункции

Функция СДвижкомIbcmd(Движок) Экспорт
	_Движки.Вставить("ДвижокIbcmd", Движок);
	Возврат ЭтотОбъект;
КонецФункции

Функция СОдинаковымДвижком(Движок) Экспорт
	СДвижкомКонфигуратор(Движок);
	СДвижкомIbcmd(Движок);
	Возврат ЭтотОбъект;
КонецФункции

Функция Собрать() Экспорт

	Сервис = Новый СервисОбработок;

	Рефлектор = Новый Рефлектор;
	Рефлектор.УстановитьСвойство(Сервис, "Движки", _Движки);
	Рефлектор.УстановитьСвойство(Сервис, "Лог", Логирование.ПолучитьЛог("vrunner"));

	Возврат Сервис;

КонецФункции
