// BSLLS:MissingVariablesDescription-off
// Билдер для сборки СервисРасширений в юнит-тестах.

#Использовать reflector
#Использовать logos
#Использовать "../../../../src/core/Сервисы"

Перем _Движки;
Перем _СервисРасчетаИнкремента;
Перем _СервисОкружения;

Процедура ПриСозданииОбъекта()
	_Движки = Новый Соответствие;
	_СервисРасчетаИнкремента = Неопределено;
	_СервисОкружения = Неопределено;
КонецПроцедуры

Функция СДвижкомКонфигуратор(Движок) Экспорт
	_Движки.Вставить("ДвижокКонфигуратор", Движок);
	Возврат ЭтотОбъект;
КонецФункции

Функция СДвижкомIbcmd(Движок) Экспорт
	_Движки.Вставить("ДвижокIbcmd", Движок);
	Возврат ЭтотОбъект;
КонецФункции

Функция СОдинаковымДвижком(Движок) Экспорт
	СДвижкомКонфигуратор(Движок);
	СДвижкомIbcmd(Движок);
	Возврат ЭтотОбъект;
КонецФункции

Функция СРасчетомИнкремента(Сервис) Экспорт
	_СервисРасчетаИнкремента = Сервис;
	Возврат ЭтотОбъект;
КонецФункции

Функция СОкружением(Сервис) Экспорт
	_СервисОкружения = Сервис;
	Возврат ЭтотОбъект;
КонецФункции

Функция Собрать() Экспорт

	Сервис = Новый СервисРасширений;

	Рефлектор = Новый Рефлектор;
	Рефлектор.УстановитьСвойство(Сервис, "Движки", _Движки);
	Рефлектор.УстановитьСвойство(Сервис, "Лог", Логирование.ПолучитьЛог("vrunner"));
	Рефлектор.УстановитьСвойство(Сервис, "СервисРасчетаИнкремента", _СервисРасчетаИнкремента);
	Рефлектор.УстановитьСвойство(Сервис, "СервисОкружения", _СервисОкружения);

	Возврат Сервис;

КонецФункции
