// BSLLS:MissingVariablesDescription-off
// Билдер ДвижокIbcmd для юнит-тестов с инжекцией фабрики УправлениеИБ.

#Использовать reflector
#Использовать logos
#Использовать "../../../../src/core/Движки"

Перем _Фабрика;

Процедура ПриСозданииОбъекта()
	_Фабрика = Неопределено;
КонецПроцедуры

Функция СФабрикойУправленияИБ(Фабрика) Экспорт
	_Фабрика = Фабрика;
	Возврат ЭтотОбъект;
КонецФункции

Функция Собрать() Экспорт

	Движок = Новый ДвижокIbcmd;

	Рефлектор = Новый Рефлектор;
	Рефлектор.УстановитьСвойство(Движок, "Лог", Логирование.ПолучитьЛог("vrunner"));
	Рефлектор.УстановитьСвойство(Движок, "_ФабрикаУправленияИБ", _Фабрика);

	Возврат Движок;

КонецФункции
