// Билдер СервисКластера для юнит-тестов.
// Внедряет фабрику УправлениеКластером1С через Рефлектор.

#Использовать reflector
#Использовать logos
#Использовать "../../../../src/core/Сервисы"

Перем _Фабрика;

Процедура ПриСозданииОбъекта()
	_Фабрика = Неопределено;
КонецПроцедуры

Функция СФабрикойУправления(Фабрика) Экспорт
	_Фабрика = Фабрика;
	Возврат ЭтотОбъект;
КонецФункции

Функция Собрать() Экспорт

	Сервис = Новый СервисКластера;

	Рефлектор = Новый Рефлектор;
	Рефлектор.УстановитьСвойство(Сервис, "Лог", Логирование.ПолучитьЛог("vrunner"));
	Рефлектор.УстановитьСвойство(Сервис, "_ФабрикаУправленияКластером", _Фабрика);

	Возврат Сервис;

КонецФункции
