// BSLLS:MissingVariablesDescription-off
// Билдер для сборки СервисEDT в юнит-тестах с подменой фабрик команды и поиска EDT.

#Использовать reflector
#Использовать logos
#Использовать "../../../../src/core/Файлы"
#Использовать "../../../../src/core/Сервисы"
#Использовать "../../../../src/core/Приложение"

Перем _ФабрикаКоманды;
Перем _ФабрикаПоискаEDT;
Перем _СервисОкружения;

Процедура ПриСозданииОбъекта()
	_ФабрикаКоманды = Неопределено;
	_ФабрикаПоискаEDT = Неопределено;
	_СервисОкружения = Неопределено;
КонецПроцедуры

Функция СОкружением(СервисОкружения) Экспорт
	_СервисОкружения = СервисОкружения;
	Возврат ЭтотОбъект;
КонецФункции

Функция СФабрикойКоманды(Фабрика) Экспорт
	_ФабрикаКоманды = Фабрика;
	Возврат ЭтотОбъект;
КонецФункции

Функция СФабрикойПоискаEDT(Фабрика) Экспорт
	_ФабрикаПоискаEDT = Фабрика;
	Возврат ЭтотОбъект;
КонецФункции

Функция Собрать() Экспорт

	Сервис = Новый СервисEDT;

	Рефлектор = Новый Рефлектор;
	Рефлектор.УстановитьСвойство(Сервис, "Лог", Логирование.ПолучитьЛог("vrunner"));
	Рефлектор.УстановитьСвойство(Сервис, "СервисОкружения",
		?(_СервисОкружения = Неопределено, Новый СервисОкружения, _СервисОкружения));
	Рефлектор.УстановитьСвойство(Сервис, "ФайловыеОперации", Новый ФайловыеОперации);
	Рефлектор.УстановитьСвойство(Сервис, "_ФабрикаКоманды", _ФабрикаКоманды);
	Рефлектор.УстановитьСвойство(Сервис, "_ФабрикаПоискаEDT", _ФабрикаПоискаEDT);

	Возврат Сервис;

КонецФункции
