// BSLLS:MissingVariablesDescription-off
// Билдер СервисХранилища для юнит-тестов.

#Использовать reflector
#Использовать logos
#Использовать "../../../../src/core/Сервисы"

Перем _Движок;
Перем _Менеджер;

Процедура ПриСозданииОбъекта()
	_Движок = Неопределено;
	_Менеджер = Неопределено;
КонецПроцедуры

Функция СДвижком(Движок) Экспорт
	_Движок = Движок;
	Возврат ЭтотОбъект;
КонецФункции

Функция СМенеджером(Менеджер) Экспорт
	_Менеджер = Менеджер;
	Возврат ЭтотОбъект;
КонецФункции

Функция Собрать() Экспорт

	Сервис = Новый СервисХранилища;

	Движки = Новый Соответствие;
	Если _Движок <> Неопределено Тогда
		Движки.Вставить("ДвижокКонфигуратор", _Движок);
	КонецЕсли;

	Рефлектор = Новый Рефлектор;
	Рефлектор.УстановитьСвойство(Сервис, "Лог", Логирование.ПолучитьЛог("vrunner"));
	Рефлектор.УстановитьСвойство(Сервис, "Движки", Движки);
	Рефлектор.УстановитьСвойство(Сервис, "_ФабрикаМенеджераХранилища", _Менеджер);

	Возврат Сервис;

КонецФункции
