// BSLLS:MissingVariablesDescription-off
// Билдер для сборки СервисПлатформы в юнит-тестах.

#Использовать reflector
#Использовать logos
#Использовать "../../../../src/core/Сервисы"

Перем _Движки;
Перем _СервисАвтономногоСервера;

Процедура ПриСозданииОбъекта()
	_Движки = Новый Соответствие;
	_СервисАвтономногоСервера = Неопределено;
КонецПроцедуры

Функция СДвижкомКонфигуратор(Движок) Экспорт
	_Движки.Вставить("ДвижокКонфигуратор", Движок);
	Возврат ЭтотОбъект;
КонецФункции

Функция СДвижкомIbcmd(Движок) Экспорт
	_Движки.Вставить("ДвижокIbcmd", Движок);
	Возврат ЭтотОбъект;
КонецФункции

Функция СОдинаковымДвижком(Движок) Экспорт
	СДвижкомКонфигуратор(Движок);
	СДвижкомIbcmd(Движок);
	Возврат ЭтотОбъект;
КонецФункции

Функция САвтономнымСервером(Сервис) Экспорт
	_СервисАвтономногоСервера = Сервис;
	Возврат ЭтотОбъект;
КонецФункции

Функция Собрать() Экспорт

	Сервис = Новый СервисПлатформы;

	Рефлектор = Новый Рефлектор;
	Рефлектор.УстановитьСвойство(Сервис, "Движки", _Движки);
	Рефлектор.УстановитьСвойство(Сервис, "Лог", Логирование.ПолучитьЛог("vrunner"));
	Рефлектор.УстановитьСвойство(Сервис, "СервисАвтономногоСервера", _СервисАвтономногоСервера);

	Возврат Сервис;

КонецФункции
