// BSLLS:MissingVariablesDescription-off
// Билдер для сборки СервисОбработок в юнит-тестах с моками движков.

#Использовать reflector
#Использовать logos
#Использовать "../../../../src/core/Файлы"
#Использовать "../../../../src/core/Сервисы"

Перем _Движки;
Перем _СервисEDT;

Процедура ПриСозданииОбъекта()
	_Движки = Новый Соответствие;
	_СервисEDT = Неопределено;
КонецПроцедуры

Функция СДвижкомКонфигуратор(Движок) Экспорт
	_Движки.Вставить("ДвижокКонфигуратор", Движок);
	Возврат ЭтотОбъект;
КонецФункции

Функция СДвижкомIbcmd(Движок) Экспорт
	_Движки.Вставить("ДвижокIbcmd", Движок);
	Возврат ЭтотОбъект;
КонецФункции

Функция СОдинаковымДвижком(Движок) Экспорт
	СДвижкомКонфигуратор(Движок);
	СДвижкомIbcmd(Движок);
	Возврат ЭтотОбъект;
КонецФункции

Функция СEDT(СервисEDT) Экспорт
	_СервисEDT = СервисEDT;
	Возврат ЭтотОбъект;
КонецФункции

Функция Собрать() Экспорт

	Сервис = Новый СервисОбработок;

	Рефлектор = Новый Рефлектор;
	Рефлектор.УстановитьСвойство(Сервис, "СервисВременнойБазы",
		Новый БилдерСервисаВременнойБазы().СДвижками(_Движки).Собрать());
	Рефлектор.УстановитьСвойство(Сервис, "Лог", Логирование.ПолучитьЛог("vrunner"));
	Рефлектор.УстановитьСвойство(Сервис, "ФайловыеОперации", Новый БилдерФайловыхОпераций().Собрать());
	Рефлектор.УстановитьСвойство(Сервис, "СервисEDT",
		?(_СервисEDT = Неопределено, Новый БилдерСервисаEDT().Собрать(), _СервисEDT));

	Возврат Сервис;

КонецФункции
