// BSLLS:MissingVariablesDescription-off
// BSLLS:LatinAndCyrillicSymbolInWord-off Технический идентификатор EDT.
// Билдер для сборки СервисИсточников в юнит-тестах.

#Использовать reflector
#Использовать logos
#Использовать "../../../../src/core/Сервисы"

Перем _СервисEDT;
Перем _СервисКонфигурации;
Перем _СервисРасширений;

Функция СEDT(Сервис) Экспорт
	_СервисEDT = Сервис;
	Возврат ЭтотОбъект;
КонецФункции

Функция СКонфигурацией(Сервис) Экспорт
	_СервисКонфигурации = Сервис;
	Возврат ЭтотОбъект;
КонецФункции

Функция СРасширениями(Сервис) Экспорт
	_СервисРасширений = Сервис;
	Возврат ЭтотОбъект;
КонецФункции

Функция Собрать() Экспорт

	Сервис = Новый СервисИсточников;

	Рефлектор = Новый Рефлектор;
	Рефлектор.УстановитьСвойство(Сервис, "Лог", Логирование.ПолучитьЛог("vrunner"));
	Рефлектор.УстановитьСвойство(Сервис, "ФайловыеОперации", Новый БилдерФайловыхОпераций().Собрать());
	Рефлектор.УстановитьСвойство(Сервис, "СервисПоискаИсточников", Новый БилдерСервисаПоискаИсточников().Собрать());
	Рефлектор.УстановитьСвойство(Сервис, "СервисEDT",
		?(_СервисEDT = Неопределено, Новый БилдерСервисаEDT().Собрать(), _СервисEDT));
	Рефлектор.УстановитьСвойство(Сервис, "СервисКонфигурации",
		?(_СервисКонфигурации = Неопределено, Новый СервисКонфигурации, _СервисКонфигурации));
	Рефлектор.УстановитьСвойство(Сервис, "СервисРасширений",
		?(_СервисРасширений = Неопределено, Новый СервисРасширений, _СервисРасширений));

	Возврат Сервис;

КонецФункции
