// BSLLS:MissingVariablesDescription-off
// Билдер ДвижокКонфигуратор для юнит-тестов с инжекцией фабрики УправлениеКонфигуратором.

#Использовать reflector
#Использовать logos
#Использовать "../../../../src/core/Файлы"
#Использовать "../../../../src/core/Движки"

Перем _Фабрика;

Процедура ПриСозданииОбъекта()
	_Фабрика = Неопределено;
КонецПроцедуры

Функция СФабрикойКонфигуратора(Фабрика) Экспорт
	_Фабрика = Фабрика;
	Возврат ЭтотОбъект;
КонецФункции

Функция Собрать() Экспорт

	Движок = Новый ДвижокКонфигуратор;

	Рефлектор = Новый Рефлектор;
	Рефлектор.УстановитьСвойство(Движок, "Лог", Логирование.ПолучитьЛог("vrunner"));
	Рефлектор.УстановитьСвойство(Движок, "ФайловыеОперации", Новый ФайловыеОперации);
	Рефлектор.УстановитьСвойство(Движок, "_ФабрикаКонфигуратора", _Фабрика);

	Возврат Движок;

КонецФункции
