// BSLLS:NumberOfValuesInStructureConstructor-off
// BSLLS:MissingParameterDescription-off
// BSLLS:MissingReturnedValueDescription-off
// BSLLS:IncorrectLineBreak-off
// Тестовые данные: параметры подключения к информационным базам.
//
// Использование:
// BSLLS:CommentedCode-off
//   Подключения = Новый ДанныеПодключений;
//   ПараметрыИБ = Подключения.Файловая("C:\tmp\base");
//   ПараметрыИБ = Подключения.ВременнаяФайловая(); // реально создаст временный каталог
// BSLLS:CommentedCode-on

#Использовать tempfiles

// Параметры подключения к фиктивной файловой ИБ по указанному каталогу.
Функция Файловая(Знач Каталог) Экспорт
	Возврат Новый Структура(
		"СтрокаПодключения, Пользователь, Пароль, КаталогБазы",
		"/F""" + Каталог + """", "", "", Каталог
	);
КонецФункции

// Параметры подключения к реально создаваемой временной файловой ИБ.
// Каталог можно потом проверить на удаление в утверждениях теста.
Функция ВременнаяФайловая() Экспорт
	Возврат Файловая(ВременныеФайлы.СоздатьКаталог());
КонецФункции
