// Стаб ИБ для СервисКластера-тестов.

Перем АдминистраторИБ Экспорт;
Перем ПарольИБ Экспорт;
Перем КоличествоОбновлений Экспорт;
Перем ПоследниеИзменения Экспорт; // Структура
Перем ИзмененияВсего Экспорт;     // Массив всех вызовов Изменить
Перем СеансыСписок_ Экспорт;       // массив СеансСтаб

Процедура ПриСозданииОбъекта()
	АдминистраторИБ = "";
	ПарольИБ = "";
	КоличествоОбновлений = 0;
	ПоследниеИзменения = Неопределено;
	ИзмененияВсего = Новый Массив;
	СеансыСписок_ = Новый Массив;
КонецПроцедуры

Функция ССеансами(Сеансы) Экспорт
	СеансыСписок_ = Сеансы;
	Возврат ЭтотОбъект;
КонецФункции

// === irac-интерфейс ИБ ===

Процедура УстановитьАдминистратора(Логин, Пароль) Экспорт
	АдминистраторИБ = Логин;
	ПарольИБ = Пароль;
КонецПроцедуры

Процедура ОбновитьДанные() Экспорт
	КоличествоОбновлений = КоличествоОбновлений + 1;
КонецПроцедуры

Процедура Изменить(Параметры) Экспорт
	ПоследниеИзменения = Параметры;
	ИзмененияВсего.Добавить(Параметры);
КонецПроцедуры

Функция Сеансы() Экспорт
	Возврат ЭтотОбъект;
КонецФункции

Функция Список() Экспорт
	Возврат СеансыСписок_;
КонецФункции
